microchip-pic-avr-solutions/matlab-lvmc-dspic33ck256mp508-foc-smo/matlab-lvmc-dspic33ck256mp508-foc-smo/dsPIC33CK256MP508_SMO_LVMC.X/dsPIC33CK256MP508_SMO_LVMC.c
/*
 * -------------------------------------------------------------------
 * MPLAB Device Blocks for Simulink v3.50.30 (21-Nov-2022)
 *
 *   Product Page:  https://www.mathworks.com/matlabcentral/fileexchange/71892
 *           Forum: https://www.microchip.com/forums/f192.aspx
 *           Wiki:  http://microchip.wikidot.com/simulink:start
 * -------------------------------------------------------------------
 * File: dsPIC33CK256MP508_SMO_LVMC.c
 *
 * Code generated for Simulink model 'dsPIC33CK256MP508_SMO_LVMC'.
 *
 * Model version                  : 7.14
 * Simulink Coder version         : 9.7 (R2022a) 13-Nov-2021
 * C/C++ source code generated on : Thu Mar 16 10:58:36 2023
 */

#include "dsPIC33CK256MP508_SMO_LVMC.h"
#include "rtwtypes.h"
#include "dsPIC33CK256MP508_SMO_LVMC_private.h"
#include "MCHP_MACRO_AddSubSat.h"
#include "MCHP_MACRO_Saturate.h"
#include "MCHP_MACRO_Atan2.h"
#include "MCHP_MACRO_SQRT.h"
#include "zero_crossing_types.h"

/* Named constants for Chart: '<S148>/Chart' */
#define dsPIC33CK256MP508_SMO_LVMC_IN_Align ((uint8_T)1U)
#define dsPIC33CK256MP508_SMO_LVMC_IN_ClosedLoop ((uint8_T)2U)
#define dsPIC33CK256MP508_SMO_LVMC_IN_ClosedLoopFilter ((uint8_T)3U)
#define dsPIC33CK256MP508_SMO_LVMC_IN_Init ((uint8_T)4U)
#define dsPIC33CK256MP508_SMO_LVMC_IN_NO_ACTIVE_CHILD ((uint8_T)0U)
#define dsPIC33CK256MP508_SMO_LVMC_IN_OpenLoop ((uint8_T)5U)

/* Block signals (default storage) */
B_dsPIC33CK256MP508_SMO_LVMC_T dsPIC33CK256MP508_SMO_LVMC_B;

/* Block states (default storage) */
DW_dsPIC33CK256MP508_SMO_LVMC_T dsPIC33CK256MP508_SMO_LVMC_DW;

/* Previous zero-crossings (trigger) states */
PrevZCX_dsPIC33CK256MP508_SMO_LVMC_T dsPIC33CK256MP508_SMO_LVMC_PrevZCX;

/* Real-time model */
static RT_MODEL_dsPIC33CK256MP508_SMO_LVMC_T dsPIC33CK256MP508_SMO_LVMC_M_;
RT_MODEL_dsPIC33CK256MP508_SMO_LVMC_T *const dsPIC33CK256MP508_SMO_LVMC_M =
  &dsPIC33CK256MP508_SMO_LVMC_M_;
void mul_wide_s32(int32_T in0, int32_T in1, uint32_T *ptrOutBitsHi, uint32_T
                  *ptrOutBitsLo)
{
  uint32_T absIn0;
  uint32_T absIn1;
  uint32_T in0Hi;
  uint32_T in0Lo;
  uint32_T in1Hi;
  uint32_T productHiLo;
  uint32_T productLoHi;
  absIn0 = in0 < 0L ? ~(uint32_T)in0 + 1UL : (uint32_T)in0;
  absIn1 = in1 < 0L ? ~(uint32_T)in1 + 1UL : (uint32_T)in1;
  in0Hi = absIn0 >> 16UL;
  in0Lo = absIn0 & 65535UL;
  in1Hi = absIn1 >> 16UL;
  absIn0 = absIn1 & 65535UL;
  productHiLo = in0Hi * absIn0;
  productLoHi = in0Lo * in1Hi;
  absIn0 *= in0Lo;
  absIn1 = 0UL;
  in0Lo = (productLoHi << 16UL) + absIn0;
  if (in0Lo < absIn0) {
    absIn1 = 1UL;
  }

  absIn0 = in0Lo;
  in0Lo += productHiLo << 16UL;
  if (in0Lo < absIn0) {
    absIn1++;
  }

  absIn0 = (((productLoHi >> 16UL) + (productHiLo >> 16UL)) + in0Hi * in1Hi) +
    absIn1;
  if ((in0 != 0L) && ((in1 != 0L) && ((in0 > 0L) != (in1 > 0L)))) {
    absIn0 = ~absIn0;
    in0Lo = ~in0Lo;
    in0Lo++;
    if (in0Lo == 0UL) {
      absIn0++;
    }
  }

  *ptrOutBitsHi = absIn0;
  *ptrOutBitsLo = in0Lo;
}

int32_T mul_s32_hiSR(int32_T a, int32_T b, uint32_T aShift)
{
  uint32_T u32_chi;
  uint32_T u32_clo;
  mul_wide_s32(a, b, &u32_chi, &u32_clo);
  return (int32_T)u32_chi >> aShift;
}

int32_T mul_s32_loSR(int32_T a, int32_T b, uint32_T aShift)
{
  uint32_T u32_chi;
  uint32_T u32_clo;
  mul_wide_s32(a, b, &u32_chi, &u32_clo);
  u32_clo = u32_chi << (32UL - aShift) | u32_clo >> aShift;
  return (int32_T)u32_clo;
}

void mul_wide_u32(uint32_T in0, uint32_T in1, uint32_T *ptrOutBitsHi, uint32_T
                  *ptrOutBitsLo)
{
  uint32_T in0Hi;
  uint32_T in0Lo;
  uint32_T in1Hi;
  uint32_T in1Lo;
  uint32_T outBitsLo;
  uint32_T productHiLo;
  uint32_T productLoHi;
  in0Hi = in0 >> 16UL;
  in0Lo = in0 & 65535UL;
  in1Hi = in1 >> 16UL;
  in1Lo = in1 & 65535UL;
  productHiLo = in0Hi * in1Lo;
  productLoHi = in0Lo * in1Hi;
  in0Lo *= in1Lo;
  in1Lo = 0UL;
  outBitsLo = (productLoHi << 16UL) + in0Lo;
  if (outBitsLo < in0Lo) {
    in1Lo = 1UL;
  }

  in0Lo = outBitsLo;
  outBitsLo += productHiLo << 16UL;
  if (outBitsLo < in0Lo) {
    in1Lo++;
  }

  *ptrOutBitsHi = (((productLoHi >> 16UL) + (productHiLo >> 16UL)) + in0Hi *
                   in1Hi) + in1Lo;
  *ptrOutBitsLo = outBitsLo;
}

uint32_T mul_u32_hiSR(uint32_T a, uint32_T b, uint32_T aShift)
{
  uint32_T u32_chi;
  uint32_T u32_clo;
  mul_wide_u32(a, b, &u32_chi, &u32_clo);
  return u32_chi >> aShift;
}

int16_T div_s16_floor(int16_T numerator, int16_T denominator)
{
  int16_T quotient;
  uint16_T absDenominator;
  uint16_T absNumerator;
  uint16_T tempAbsQuotient;
  boolean_T quotientNeedsNegation;
  if (denominator == 0) {
    quotient = numerator >= 0 ? MAX_int16_T : MIN_int16_T;

    /* Divide by zero handler */
  } else {
    absNumerator = numerator < 0 ? ~(uint16_T)numerator + 1U : (uint16_T)
      numerator;
    absDenominator = denominator < 0 ? ~(uint16_T)denominator + 1U : (uint16_T)
      denominator;
    quotientNeedsNegation = ((numerator < 0) != (denominator < 0));
    tempAbsQuotient = absNumerator / absDenominator;
    if (quotientNeedsNegation) {
      absNumerator %= absDenominator;
      if (absNumerator > 0U) {
        tempAbsQuotient++;
      }
    }

    quotient = quotientNeedsNegation ? -(int16_T)tempAbsQuotient : (int16_T)
      tempAbsQuotient;
  }

  return quotient;
}

/* System initialize for atomic system: '<Root>/Speed Control' */
void dsPIC33CK256MP508_SMO_LVMC_SpeedControl_Init(void)
{
  /* InitializeConditions for RateLimiter: '<S4>/Rate Limiter2' */
  dsPIC33CK256MP508_SMO_LVMC_DW.PrevY = 0;

  /* InitializeConditions for DiscreteIntegrator: '<S216>/Integrator' incorporates:
   *  Constant: '<S177>/Ki2'
   */
  dsPIC33CK256MP508_SMO_LVMC_DW.Integrator_DSTATE_f = 0;
  dsPIC33CK256MP508_SMO_LVMC_DW.Integrator_PrevResetState_o = 0;
}

/* Output and update for atomic system: '<Root>/Speed Control' */
void dsPIC33CK256MP508_SMO_LVMC_SpeedControl(void)
{
  /* local block i/o variables */
  boolean_T rtb_ButtonS2;
  int32_T tmp;
  int16_T rtb_IProdOut;
  int16_T rtb_RateLimiter2;
  int16_T rtb_Sum;
  int16_T rtb_Sum_j;
  int8_T rtb_IProdOut_0;
  int8_T rtb_Switch1;
  boolean_T rtb_LogicalOperator;
  boolean_T rtb_RelationalOperator;

  /* RateLimiter: '<S4>/Rate Limiter2' incorporates:
   *  RateTransition: '<Root>/Rate Transition6'
   */
  tmp = (int32_T)dsPIC33CK256MP508_SMO_LVMC_B.RateTransition6 -
    dsPIC33CK256MP508_SMO_LVMC_DW.PrevY;
  if (tmp > 12L) {
    rtb_RateLimiter2 = (int16_T)(dsPIC33CK256MP508_SMO_LVMC_DW.PrevY + 12L);
  } else if (tmp < -5L) {
    rtb_RateLimiter2 = (int16_T)(dsPIC33CK256MP508_SMO_LVMC_DW.PrevY + -5L);
  } else {
    rtb_RateLimiter2 = dsPIC33CK256MP508_SMO_LVMC_B.RateTransition6;
  }

