microchip-pic-avr-solutions/matlab-lvmc-dspic33ck256mp508-foc-smo/matlab-lvmc-dspic33ck256mp508-foc-smo/dsPIC33CK256MP508_SMO_LVMC.X/dsPIC33CK256MP508_SMO_LVMC.c
  dsPIC33CK256MP508_SMO_LVMC_DW.PrevY = rtb_RateLimiter2;

  /* End of RateLimiter: '<S4>/Rate Limiter2' */

  /* Switch: '<S178>/Switch' incorporates:
   *  Constant: '<S178>/Constant'
   *  DataStoreRead: '<S178>/Data Store Read1'
   *  DataStoreWrite: '<S4>/Data Store Write'
   */
  if (dsPIC33CK256MP508_SMO_LVMC_DW.EnableFOC) {
    /* Saturate: '<S4>/Saturation' incorporates:
     *  DataStoreWrite: '<S4>/Data Store Write'
     *  RateLimiter: '<S4>/Rate Limiter2'
     *  Switch: '<S178>/Switch'
     */
    if (rtb_RateLimiter2 > 20367) {
      dsPIC33CK256MP508_SMO_LVMC_DW.SpeedRef = 20367;
    } else if (rtb_RateLimiter2 < 2829) {
      dsPIC33CK256MP508_SMO_LVMC_DW.SpeedRef = 2829;
    } else {
      dsPIC33CK256MP508_SMO_LVMC_DW.SpeedRef = rtb_RateLimiter2;
    }

    /* End of Saturate: '<S4>/Saturation' */
  } else {
    dsPIC33CK256MP508_SMO_LVMC_DW.SpeedRef = 0;
  }

  /* End of Switch: '<S178>/Switch' */

  /* Constant: '<S4>/Id_ref' */
  dsPIC33CK256MP508_SMO_LVMC_B.Id_ref = 0;

  /* Sum: '<S235>/Add1' incorporates:
   *  DataStoreWrite: '<S4>/Data Store Write'
   *  Product: '<S235>/Product'
   *  Product: '<S235>/Product1'
   *  Switch: '<S178>/Switch'
   *  UnitDelay: '<S235>/Unit Delay'
   */
  rtb_RateLimiter2 = (int16_T)((dsPIC33CK256MP508_SMO_LVMC_DW.SpeedRef * 123L) >>
    12) + (int16_T)((3973L * dsPIC33CK256MP508_SMO_LVMC_DW.UnitDelay_DSTATE) >>
                    12);

  /* Sum: '<S177>/Sum' incorporates:
   *  RateTransition: '<Root>/Rate Transition7'
   *  Sum: '<S235>/Add1'
   */
  rtb_Sum_j = rtb_RateLimiter2 - dsPIC33CK256MP508_SMO_LVMC_B.RateTransition7;

  /* Logic: '<S177>/Logical Operator' incorporates:
   *  DataStoreRead: '<S177>/Data Store Read1'
   *  DataStoreRead: '<S177>/Data Store Read2'
   *  Logic: '<S177>/AND'
   */
  rtb_LogicalOperator = ((!dsPIC33CK256MP508_SMO_LVMC_DW.EnableClosedLoop) ||
    (!dsPIC33CK256MP508_SMO_LVMC_DW.Enable));

  /* DiscreteIntegrator: '<S216>/Integrator' incorporates:
   *  Constant: '<S177>/Ki2'
   */
  if (rtb_LogicalOperator ||
      (dsPIC33CK256MP508_SMO_LVMC_DW.Integrator_PrevResetState_o != 0)) {
    dsPIC33CK256MP508_SMO_LVMC_DW.Integrator_DSTATE_f = 0;
  }

  /* Sum: '<S225>/Sum' incorporates:
   *  DiscreteIntegrator: '<S216>/Integrator'
   *  Product: '<S221>/PProd Out'
   *  Sum: '<S177>/Sum'
   */
  rtb_Sum = (int16_T)((rtb_Sum_j * 1923L) >> 12) +
    dsPIC33CK256MP508_SMO_LVMC_DW.Integrator_DSTATE_f;

  /* DeadZone: '<S209>/DeadZone' incorporates:
   *  Product: '<S213>/IProd Out'
   *  Sum: '<S225>/Sum'
   */
  if (rtb_Sum > 16384) {
    rtb_IProdOut = rtb_Sum - 16384;
  } else if (rtb_Sum >= -16384) {
    rtb_IProdOut = 0;
  } else {
    rtb_IProdOut = rtb_Sum - -16384;
  }

  /* End of DeadZone: '<S209>/DeadZone' */

  /* RelationalOperator: '<S207>/Relational Operator' incorporates:
   *  Product: '<S213>/IProd Out'
   */
  rtb_RelationalOperator = (rtb_IProdOut != 0);

  /* Switch: '<S207>/Switch1' incorporates:
   *  Constant: '<S207>/Constant'
   *  Constant: '<S207>/Constant2'
   *  Product: '<S213>/IProd Out'
   *  RelationalOperator: '<S207>/fix for DT propagation issue'
   */
  if (rtb_IProdOut > 0) {
    rtb_Switch1 = 1;
  } else {
    rtb_Switch1 = -1;
  }

  /* End of Switch: '<S207>/Switch1' */

  /* Product: '<S213>/IProd Out' incorporates:
   *  Constant: '<S177>/Ki1'
   *  Sum: '<S177>/Sum'
   */
  rtb_IProdOut = (int16_T)((rtb_Sum_j * 221L) >> 14);

  /* Switch: '<S4>/Switch' incorporates:
   *  DataStoreRead: '<S4>/Data Store Read'
   */
  if (dsPIC33CK256MP508_SMO_LVMC_DW.EnableClosedLoop) {
    /* Saturate: '<S223>/Saturation' incorporates:
     *  Sum: '<S225>/Sum'
     */
    if (rtb_Sum > 16384) {
      /* Switch: '<S4>/Switch' */
      dsPIC33CK256MP508_SMO_LVMC_B.Switch = 16384;
    } else if (rtb_Sum < -16384) {
      /* Switch: '<S4>/Switch' */
      dsPIC33CK256MP508_SMO_LVMC_B.Switch = -16384;
    } else {
      /* Switch: '<S4>/Switch' */
      dsPIC33CK256MP508_SMO_LVMC_B.Switch = rtb_Sum;
    }

    /* End of Saturate: '<S223>/Saturation' */
  } else {
    /* Switch: '<S4>/Switch' incorporates:
     *  Constant: '<S4>/Iq_ref1'
     */
    dsPIC33CK256MP508_SMO_LVMC_B.Switch = 562;
  }

  /* End of Switch: '<S4>/Switch' */

  /* S-Function (MCHP_Digital_Input): '<S179>/Button S2' */
  /* MCHP_Digital_Input Block: <S179>/Button S2/Output */
  rtb_ButtonS2 = PORTEbits.RE11;       /* Read pin E11 */

  /* Outputs for Triggered SubSystem: '<S179>/Triggered Subsystem' incorporates:
   *  TriggerPort: '<S180>/Trigger'
   */
  if ((!rtb_ButtonS2) &&
      (dsPIC33CK256MP508_SMO_LVMC_PrevZCX.TriggeredSubsystem_Trig_ZCE !=
       ZERO_ZCSIG)) {
    /* Logic: '<S180>/NOT' incorporates:
     *  DataStoreWrite: '<S180>/Data Store Write'
     *  Delay: '<S180>/Delay'
     */
    dsPIC33CK256MP508_SMO_LVMC_DW.Enable =
      !dsPIC33CK256MP508_SMO_LVMC_DW.Delay_DSTATE_a;

    /* Update for Delay: '<S180>/Delay' incorporates:
     *  DataStoreWrite: '<S180>/Data Store Write'
     */
    dsPIC33CK256MP508_SMO_LVMC_DW.Delay_DSTATE_a =
      dsPIC33CK256MP508_SMO_LVMC_DW.Enable;
  }

  dsPIC33CK256MP508_SMO_LVMC_PrevZCX.TriggeredSubsystem_Trig_ZCE = rtb_ButtonS2;

  /* End of Outputs for SubSystem: '<S179>/Triggered Subsystem' */

  /* Update for UnitDelay: '<S235>/Unit Delay' incorporates:
   *  Sum: '<S235>/Add1'
   */
  dsPIC33CK256MP508_SMO_LVMC_DW.UnitDelay_DSTATE = rtb_RateLimiter2;

  /* Switch: '<S207>/Switch2' incorporates:
   *  Constant: '<S207>/Constant3'
   *  Constant: '<S207>/Constant4'
   *  Product: '<S213>/IProd Out'
   *  RelationalOperator: '<S207>/fix for DT propagation issue1'
   */
  if (rtb_IProdOut > 0) {
    rtb_IProdOut_0 = 1;
  } else {
    rtb_IProdOut_0 = -1;
  }

  /* End of Switch: '<S207>/Switch2' */

  /* Switch: '<S207>/Switch' incorporates:
   *  Constant: '<S207>/Constant1'
   *  Logic: '<S207>/AND3'
   *  RelationalOperator: '<S207>/Equal1'
   */
  if (rtb_RelationalOperator && (rtb_Switch1 == rtb_IProdOut_0)) {
    rtb_IProdOut = 0;
  }

  /* End of Switch: '<S207>/Switch' */

  /* Update for DiscreteIntegrator: '<S216>/Integrator' */
  dsPIC33CK256MP508_SMO_LVMC_DW.Integrator_DSTATE_f += rtb_IProdOut;
  dsPIC33CK256MP508_SMO_LVMC_DW.Integrator_PrevResetState_o = (int8_T)
    rtb_LogicalOperator;
}

