microchip-pic-avr-solutions/matlab-lvmc-dspic33ck256mp508-foc-smo/matlab-lvmc-dspic33ck256mp508-foc-smo/dsPIC33CK256MP508_SMO_LVMC.X/dsPIC33CK256MP508_SMO_LVMC.c
/* Model step function for TID0 */
void dsPIC33CK256MP508_SMO_LVMC_step0(void) /* Sample time: [5.0E-5s, 0.0s] */
{
  int32_T tmp;
  int16_T rtb_RateTransition5[2];
  int16_T DiscreteTimeIntegrator;
  int16_T DiscreteTimeIntegrator2_idx_0;
  int16_T DiscreteTimeIntegrator2_idx_1;
  int16_T DiscreteTimeIntegrator4;
  int16_T DiscreteTimeIntegrator_idx_0;
  int16_T rtb_DeadZone;
  int16_T rtb_Gain5;
  int16_T rtb_Gain7_e_idx_0;
  int16_T rtb_Gain7_e_idx_1;
  int16_T rtb_Gain_d;
  int16_T rtb_IProdOut;
  int16_T rtb_Integrator_i;
  int16_T rtb_Saturation_g;
  int16_T rtb_Sum;
  int16_T rtb_Sum4_f;
  int16_T rtb_Sum4_j_idx_0;
  int16_T rtb_Sum4_j_idx_1;
  int16_T rtb_Switch1;
  int16_T rtb_Switch1_j_idx_0;
  int16_T rtb_ToPerUnit_idx_0;
  int16_T rtb_ToPerUnit_idx_1;
  int16_T rtb_sum_beta;
  uint16_T rtb_DataTypeConversion;
  uint16_T rtb_DeadtimeCompensation_idx_1;
  uint16_T rtb_DeadtimeCompensation_idx_2;
  int8_T rtb_DeadZone_0;
  int8_T rtb_IProdOut_i;
  boolean_T EnCurOffset;
  boolean_T rtb_LogicalOperator_o_tmp;

  /* Outputs for Enabled SubSystem: '<S140>/Up Counter' incorporates:
   *  EnablePort: '<S142>/Enable'
   */
  /* Logic: '<S140>/NOT' incorporates:
   *  Delay: '<S140>/Delay'
   */
  if (!dsPIC33CK256MP508_SMO_LVMC_DW.Delay_DSTATE_n) {
    if (!dsPIC33CK256MP508_SMO_LVMC_DW.UpCounter_MODE) {
      /* InitializeConditions for Delay: '<S142>/Delay' */
      dsPIC33CK256MP508_SMO_LVMC_DW.Delay_DSTATE = 0UL;
      dsPIC33CK256MP508_SMO_LVMC_DW.UpCounter_MODE = true;
    }

    /* Sum: '<S142>/Add1' incorporates:
     *  Constant: '<S142>/Constant'
     *  Delay: '<S142>/Delay'
     */
    dsPIC33CK256MP508_SMO_LVMC_B.Add1 = MCHP_addSat_CAO_u32_u32_u32(1UL,
      dsPIC33CK256MP508_SMO_LVMC_DW.Delay_DSTATE);

    /* Update for Delay: '<S142>/Delay' */
    dsPIC33CK256MP508_SMO_LVMC_DW.Delay_DSTATE =
      dsPIC33CK256MP508_SMO_LVMC_B.Add1;
  } else {
    dsPIC33CK256MP508_SMO_LVMC_DW.UpCounter_MODE = false;
  }

  /* End of Logic: '<S140>/NOT' */
  /* End of Outputs for SubSystem: '<S140>/Up Counter' */

  /* Gain: '<S141>/Gain' */
  rtb_Gain_d = (int16_T)mul_u32_hiSR(3518437209UL,
    dsPIC33CK256MP508_SMO_LVMC_B.Add1, 2UL);

  /* RelationalOperator: '<S144>/Compare' incorporates:
   *  DataStoreWrite: '<S141>/Data Store Write'
   *  Gain: '<S141>/Gain'
   */
  EnCurOffset = (rtb_Gain_d < 4096);

  /* RelationalOperator: '<S143>/Compare' incorporates:
   *  DataStoreWrite: '<S141>/Data Store Write1'
   *  Gain: '<S141>/Gain'
   */
  dsPIC33CK256MP508_SMO_LVMC_DW.EnableFOC = (rtb_Gain_d >= 8192);

  /* RateTransition: '<Root>/Rate Transition5' */
  rtb_Sum4_f = dsPIC33CK256MP508_SMO_LVMC_DW.RateTransition5_ActiveBufIdx << 1;
  rtb_RateTransition5[0] =
    dsPIC33CK256MP508_SMO_LVMC_DW.RateTransition5_Buffer[rtb_Sum4_f];
  rtb_RateTransition5[1] =
    dsPIC33CK256MP508_SMO_LVMC_DW.RateTransition5_Buffer[rtb_Sum4_f + 1];

  /* S-Function (MCHP_ADC_HighSpeed_SAR_dsPIC): '<S7>/ADC dsPIC High Speed SAR' */
  dsPIC33CK256MP508_SMO_LVMC_B.ADCdsPICHighSpeedSAR_o1 = (signed int) ADCBUF0;/* Read ADC converted value */
  dsPIC33CK256MP508_SMO_LVMC_B.ADCdsPICHighSpeedSAR_o2 = (signed int) ADCBUF1;/* Read ADC converted value */
  dsPIC33CK256MP508_SMO_LVMC_B.U2CH2 = (unsigned int) ADCBUF11;/* Read ADC converted value */

  /* Outputs for Enabled SubSystem: '<S7>/Offset1' incorporates:
   *  EnablePort: '<S139>/Enable'
   */
  /* DataStoreRead: '<S7>/Data Store Read' */
  if (EnCurOffset) {
    /* SignalConversion generated from: '<S139>/Iab' */
    dsPIC33CK256MP508_SMO_LVMC_B.Iab[0] =
      dsPIC33CK256MP508_SMO_LVMC_B.ADCdsPICHighSpeedSAR_o1;
    dsPIC33CK256MP508_SMO_LVMC_B.Iab[1] =
      dsPIC33CK256MP508_SMO_LVMC_B.ADCdsPICHighSpeedSAR_o2;
  }

  /* End of DataStoreRead: '<S7>/Data Store Read' */
  /* End of Outputs for SubSystem: '<S7>/Offset1' */

  /* Gain: '<S7>/To Per-Unit' incorporates:
   *  SignalConversion generated from: '<S7>/Add2'
   *  Sum: '<S7>/Add2'
   */
  tmp = (dsPIC33CK256MP508_SMO_LVMC_B.ADCdsPICHighSpeedSAR_o1 -
         dsPIC33CK256MP508_SMO_LVMC_B.Iab[0]) * -23995L;
  tmp = (((tmp < 0L ? MAX_uint16_T : 0U) + tmp) >> 16) * 2795L;
  rtb_ToPerUnit_idx_0 = (int16_T)(((tmp < 0L ? 2047 : 0) + tmp) >> 11);
  tmp = (dsPIC33CK256MP508_SMO_LVMC_B.ADCdsPICHighSpeedSAR_o2 -
         dsPIC33CK256MP508_SMO_LVMC_B.Iab[1]) * -23995L;
  tmp = (((tmp < 0L ? MAX_uint16_T : 0U) + tmp) >> 16) * 2795L;
  rtb_ToPerUnit_idx_1 = (int16_T)(((tmp < 0L ? 2047 : 0) + tmp) >> 11);

  /* Outputs for Atomic SubSystem: '<S5>/Clarke Transform' */
  /* AlgorithmDescriptorDelegate generated from: '<S11>/a16' incorporates:
   *  Gain: '<S11>/one_by_sqrt3'
   *  Sum: '<S11>/a_plus_2b'
   */
  rtb_ToPerUnit_idx_1 = (int16_T)((((rtb_ToPerUnit_idx_0 + rtb_ToPerUnit_idx_1)
    + rtb_ToPerUnit_idx_1) * 18919L) >> 15);

  /* End of Outputs for SubSystem: '<S5>/Clarke Transform' */

  /* Gain: '<S155>/Gain' incorporates:
   *  DataStoreRead: '<S9>/Data Store Read'
   *  DiscreteIntegrator: '<S58>/Integrator'
   *  Gain: '<S155>/Inverting OpAmp5'
   */
  rtb_Integrator_i = (int16_T)((((181L * dsPIC33CK256MP508_SMO_LVMC_DW.SpeedRef)
    >> 8) * 17157L) >> 14);

  /* Abs: '<S149>/Abs' incorporates:
   *  DiscreteIntegrator: '<S58>/Integrator'
   */
  if (rtb_Integrator_i < 0) {
    rtb_Integrator_i = -rtb_Integrator_i;
  }

  /* End of Abs: '<S149>/Abs' */

  /* Delay: '<S149>/Delay2' incorporates:
   *  Sum: '<S149>/Sum4'
   */
  rtb_Sum4_j_idx_0 = dsPIC33CK256MP508_SMO_LVMC_DW.Delay2_DSTATE[0];
  rtb_Sum4_j_idx_1 = dsPIC33CK256MP508_SMO_LVMC_DW.Delay2_DSTATE[1];

  /* Sum: '<S149>/Sum' incorporates:
   *  Delay: '<S1>/Delay'
   *  Gain: '<S149>/Gain7'
   *  Gain: '<S155>/Inverting OpAmp1'
   *  Gain: '<S155>/Inverting OpAmp2'
   *  Sum: '<S149>/Sum4'
   */
  rtb_Gain7_e_idx_0 = rtb_Sum4_j_idx_0 - (int16_T)((11187L *
    dsPIC33CK256MP508_SMO_LVMC_DW.Delay_DSTATE_h[0]) >> 12);
  rtb_Gain7_e_idx_1 = rtb_Sum4_j_idx_1 - (int16_T)((11187L *
    dsPIC33CK256MP508_SMO_LVMC_DW.Delay_DSTATE_h[1]) >> 12);

  /* Abs: '<S156>/Abs1' incorporates:
   *  Gain: '<S149>/Gain7'
   */
  if (rtb_Gain7_e_idx_0 < 0) {
    DiscreteTimeIntegrator2_idx_0 = -rtb_Gain7_e_idx_0;
  } else {
    DiscreteTimeIntegrator2_idx_0 = rtb_Gain7_e_idx_0;
  }

