microchip-pic-avr-solutions/matlab-lvmc-dspic33ck256mp508-foc-smo/matlab-lvmc-dspic33ck256mp508-foc-smo/dsPIC33CK256MP508_SMO_LVMC.X/dsPIC33CK256MP508_SMO_LVMC.c
  /* Switch: '<S156>/Switch1' incorporates:
   *  Abs: '<S156>/Abs1'
   *  Gain: '<S149>/Gain7'
   *  Gain: '<S156>/Gain4'
   *  Gain: '<S156>/Gain7'
   *  RelationalOperator: '<S159>/Compare'
   */
  if (DiscreteTimeIntegrator2_idx_0 >= 2110) {
    /* Signum: '<S156>/Sign1' incorporates:
     *  Abs: '<S156>/Abs1'
     *  Gain: '<S149>/Gain7'
     */
    if (rtb_Gain7_e_idx_0 < 0) {
      rtb_Gain7_e_idx_0 = -1;
    } else {
      rtb_Gain7_e_idx_0 = (rtb_Gain7_e_idx_0 > 0);
    }

    rtb_Switch1 = (31867 * rtb_Gain7_e_idx_0) >> 4;
  } else {
    rtb_Switch1 = (int16_T)((15465L * rtb_Gain7_e_idx_0) >> 14);
  }

  /* DiscreteIntegrator: '<S154>/Discrete-Time Integrator' incorporates:
   *  Delay: '<S154>/Delay'
   *  DiscreteIntegrator: '<S58>/Integrator'
   *  Product: '<S154>/Product'
   *  Sum: '<S154>/Sum2'
   */
  DiscreteTimeIntegrator = (int16_T)mul_s32_hiSR(439804651L, ((int32_T)
    (rtb_Switch1 - dsPIC33CK256MP508_SMO_LVMC_DW.Delay_DSTATE_i[0]) *
    rtb_Integrator_i) >> 3, 11UL) +
    dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator_DSTATE_e[0];

  /* DiscreteIntegrator: '<S154>/Discrete-Time Integrator2' incorporates:
   *  Delay: '<S154>/Delay3'
   *  DiscreteIntegrator: '<S58>/Integrator'
   *  Product: '<S154>/Product2'
   *  Sum: '<S154>/Sum3'
   */
  DiscreteTimeIntegrator2_idx_0 = (int16_T)mul_s32_hiSR(439804651L, ((int32_T)
    (DiscreteTimeIntegrator - dsPIC33CK256MP508_SMO_LVMC_DW.Delay3_DSTATE[0]) *
    rtb_Integrator_i) >> 3, 11UL) +
    dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator2_DSTATE[0];

  /* Switch: '<S156>/Switch1' */
  rtb_Switch1_j_idx_0 = rtb_Switch1;

  /* DiscreteIntegrator: '<S154>/Discrete-Time Integrator' */
  DiscreteTimeIntegrator_idx_0 = DiscreteTimeIntegrator;

  /* Abs: '<S156>/Abs1' incorporates:
   *  Gain: '<S149>/Gain7'
   */
  if (rtb_Gain7_e_idx_1 < 0) {
    rtb_Switch1 = -rtb_Gain7_e_idx_1;
  } else {
    rtb_Switch1 = rtb_Gain7_e_idx_1;
  }

  /* Switch: '<S156>/Switch1' incorporates:
   *  Abs: '<S156>/Abs1'
   *  Gain: '<S149>/Gain7'
   *  Gain: '<S156>/Gain4'
   *  Gain: '<S156>/Gain7'
   *  RelationalOperator: '<S159>/Compare'
   */
  if (rtb_Switch1 >= 2110) {
    /* Signum: '<S156>/Sign1' incorporates:
     *  Abs: '<S156>/Abs1'
     *  Gain: '<S149>/Gain7'
     */
    if (rtb_Gain7_e_idx_1 < 0) {
      rtb_Gain7_e_idx_1 = -1;
    } else {
      rtb_Gain7_e_idx_1 = (rtb_Gain7_e_idx_1 > 0);
    }

    rtb_Switch1 = (31867 * rtb_Gain7_e_idx_1) >> 4;
  } else {
    rtb_Switch1 = (int16_T)((15465L * rtb_Gain7_e_idx_1) >> 14);
  }

  /* DiscreteIntegrator: '<S154>/Discrete-Time Integrator' incorporates:
   *  Delay: '<S154>/Delay'
   *  DiscreteIntegrator: '<S58>/Integrator'
   *  Product: '<S154>/Product'
   *  Sum: '<S154>/Sum2'
   */
  DiscreteTimeIntegrator = (int16_T)mul_s32_hiSR(439804651L, ((int32_T)
    (rtb_Switch1 - dsPIC33CK256MP508_SMO_LVMC_DW.Delay_DSTATE_i[1]) *
    rtb_Integrator_i) >> 3, 11UL) +
    dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator_DSTATE_e[1];

  /* DiscreteIntegrator: '<S154>/Discrete-Time Integrator2' incorporates:
   *  Delay: '<S154>/Delay3'
   *  DiscreteIntegrator: '<S58>/Integrator'
   *  Product: '<S154>/Product2'
   *  Sum: '<S154>/Sum3'
   */
  DiscreteTimeIntegrator2_idx_1 = (int16_T)mul_s32_hiSR(439804651L, ((int32_T)
    (DiscreteTimeIntegrator - dsPIC33CK256MP508_SMO_LVMC_DW.Delay3_DSTATE[1]) *
    rtb_Integrator_i) >> 3, 11UL) +
    dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator2_DSTATE[1];

  /* Gain: '<S158>/Gain3' incorporates:
   *  Sum: '<S13>/sum_beta'
   */
  rtb_sum_beta = -DiscreteTimeIntegrator2_idx_0;

  /* Gain: '<S158>/Gain5' incorporates:
   *  Bias: '<S158>/Bias3'
   *  DataTypeConversion: '<S158>/Cast2'
   *  Sum: '<S13>/sum_beta'
   *  Trigonometry: '<S158>/Trigonometric Function1'
   */
  rtb_Gain5 = (int16_T)(((MCHP_MACRO_Atan2(rtb_sum_beta,
    DiscreteTimeIntegrator2_idx_1, 32768U, MAX_uint16_T) + 12975U) * 3217UL) >>
                        13);

  /* Sum: '<S157>/Sum2' incorporates:
   *  Gain: '<S158>/Gain5'
   *  UnitDelay: '<S157>/Unit Delay3'
   */
  DiscreteTimeIntegrator4 = rtb_Gain5 -
    dsPIC33CK256MP508_SMO_LVMC_DW.UnitDelay3_DSTATE;

  /* Bias: '<S160>/Bias' incorporates:
   *  Math: '<S160>/Math Function1'
   */
  DiscreteTimeIntegrator4 = (DiscreteTimeIntegrator4 - div_s16_floor
    (DiscreteTimeIntegrator4, 25736) * 25736) + 12868;

  /* DiscreteIntegrator: '<S157>/Discrete-Time Integrator4' incorporates:
   *  Bias: '<S160>/Bias1'
   *  Delay: '<S157>/Delay1'
   *  DiscreteIntegrator: '<S58>/Integrator'
   *  Gain: '<S157>/Gain1'
   *  Gain: '<S157>/Gain2'
   *  Math: '<S160>/Math Function'
   *  Product: '<S157>/Product1'
   *  Sum: '<S157>/Sum4'
   */
  DiscreteTimeIntegrator4 = (int16_T)mul_s32_hiSR(439804651L, (((int16_T)
    ((((DiscreteTimeIntegrator4 - div_s16_floor(DiscreteTimeIntegrator4, 25736) *
        25736) + -12868) * 625L) >> 4) -
    dsPIC33CK256MP508_SMO_LVMC_DW.Delay1_DSTATE) * ((19661L * rtb_Integrator_i) >>
    16)) << 2, 16UL) +
    dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator4_DSTATE;

  /* Gain: '<S149>/Gain8' incorporates:
   *  DiscreteIntegrator: '<S157>/Discrete-Time Integrator4'
   */
  dsPIC33CK256MP508_SMO_LVMC_B.Gain8 = (int16_T)((22129L *
    DiscreteTimeIntegrator4) >> 14);

  /* Chart: '<S148>/Chart' incorporates:
   *  DataStoreRead: '<S148>/Data Store Read5'
   *  Gain: '<S149>/Gain8'
   */
  if (dsPIC33CK256MP508_SMO_LVMC_DW.temporalCounter_i1 < MAX_uint16_T) {
    dsPIC33CK256MP508_SMO_LVMC_DW.temporalCounter_i1++;
  }

  /* Gateway: Current Control/Position and Speed Estimation/OpentoClosed/Chart */
  /* During: Current Control/Position and Speed Estimation/OpentoClosed/Chart */
  if (dsPIC33CK256MP508_SMO_LVMC_DW.is_active_c3_dsPIC33CK256MP508_SMO_LVMC ==
      0U) {
    /* Entry: Current Control/Position and Speed Estimation/OpentoClosed/Chart */
    dsPIC33CK256MP508_SMO_LVMC_DW.is_active_c3_dsPIC33CK256MP508_SMO_LVMC = 1U;

    /* Entry Internal: Current Control/Position and Speed Estimation/OpentoClosed/Chart */
    /* Transition: '<S153>:2' */
    dsPIC33CK256MP508_SMO_LVMC_DW.is_c3_dsPIC33CK256MP508_SMO_LVMC =
      dsPIC33CK256MP508_SMO_LVMC_IN_Init;

    /* Entry 'Init': '<S153>:1' */
  } else {
    switch (dsPIC33CK256MP508_SMO_LVMC_DW.is_c3_dsPIC33CK256MP508_SMO_LVMC) {
     case dsPIC33CK256MP508_SMO_LVMC_IN_Align:
      /* During 'Align': '<S153>:16' */
      if (!dsPIC33CK256MP508_SMO_LVMC_DW.Enable) {
        /* Transition: '<S153>:7' */
        dsPIC33CK256MP508_SMO_LVMC_DW.is_c3_dsPIC33CK256MP508_SMO_LVMC =
          dsPIC33CK256MP508_SMO_LVMC_IN_Init;

        /* Entry 'Init': '<S153>:1' */
      } else if (dsPIC33CK256MP508_SMO_LVMC_DW.temporalCounter_i1 >= 10000U) {
        /* Transition: '<S153>:17' */
        dsPIC33CK256MP508_SMO_LVMC_DW.is_c3_dsPIC33CK256MP508_SMO_LVMC =
          dsPIC33CK256MP508_SMO_LVMC_IN_OpenLoop;
        dsPIC33CK256MP508_SMO_LVMC_DW.temporalCounter_i1 = 0U;

