microchip-pic-avr-solutions/matlab-lvmc-dspic33ck256mp508-foc-smo/matlab-lvmc-dspic33ck256mp508-foc-smo/dsPIC33CK256MP508_SMO_LVMC.X/dsPIC33CK256MP508_SMO_LVMC.c
        /* Entry 'OpenLoop': '<S153>:3' */
      } else {
        dsPIC33CK256MP508_SMO_LVMC_B.Mode = 0U;
      }
      break;

     case dsPIC33CK256MP508_SMO_LVMC_IN_ClosedLoop:
      /* During 'ClosedLoop': '<S153>:4' */
      if (!dsPIC33CK256MP508_SMO_LVMC_DW.Enable) {
        /* Transition: '<S153>:8' */
        dsPIC33CK256MP508_SMO_LVMC_DW.is_c3_dsPIC33CK256MP508_SMO_LVMC =
          dsPIC33CK256MP508_SMO_LVMC_IN_Init;

        /* Entry 'Init': '<S153>:1' */
      } else if (dsPIC33CK256MP508_SMO_LVMC_DW.temporalCounter_i1 >= 2000U) {
        /* Transition: '<S153>:22' */
        dsPIC33CK256MP508_SMO_LVMC_DW.is_c3_dsPIC33CK256MP508_SMO_LVMC =
          dsPIC33CK256MP508_SMO_LVMC_IN_ClosedLoopFilter;

        /* Entry 'ClosedLoopFilter': '<S153>:21' */
      } else {
        dsPIC33CK256MP508_SMO_LVMC_B.Mode = 2U;
      }
      break;

     case dsPIC33CK256MP508_SMO_LVMC_IN_ClosedLoopFilter:
      /* During 'ClosedLoopFilter': '<S153>:21' */
      if (!dsPIC33CK256MP508_SMO_LVMC_DW.Enable) {
        /* Transition: '<S153>:23' */
        dsPIC33CK256MP508_SMO_LVMC_DW.is_c3_dsPIC33CK256MP508_SMO_LVMC =
          dsPIC33CK256MP508_SMO_LVMC_IN_Init;

        /* Entry 'Init': '<S153>:1' */
      } else {
        dsPIC33CK256MP508_SMO_LVMC_B.Mode = 2U;
      }
      break;

     case dsPIC33CK256MP508_SMO_LVMC_IN_Init:
      /* During 'Init': '<S153>:1' */
      if (dsPIC33CK256MP508_SMO_LVMC_DW.Enable) {
        /* Transition: '<S153>:6' */
        dsPIC33CK256MP508_SMO_LVMC_DW.is_c3_dsPIC33CK256MP508_SMO_LVMC =
          dsPIC33CK256MP508_SMO_LVMC_IN_Align;
        dsPIC33CK256MP508_SMO_LVMC_DW.temporalCounter_i1 = 0U;

        /* Entry 'Align': '<S153>:16' */
      } else {
        dsPIC33CK256MP508_SMO_LVMC_B.Mode = 0U;
      }
      break;

     default:
      /* During 'OpenLoop': '<S153>:3' */
      if ((dsPIC33CK256MP508_SMO_LVMC_DW.temporalCounter_i1 >= 40000U) &&
          (dsPIC33CK256MP508_SMO_LVMC_B.Gain8 > 2829)) {
        /* Transition: '<S153>:9' */
        dsPIC33CK256MP508_SMO_LVMC_DW.is_c3_dsPIC33CK256MP508_SMO_LVMC =
          dsPIC33CK256MP508_SMO_LVMC_IN_ClosedLoop;
        dsPIC33CK256MP508_SMO_LVMC_DW.temporalCounter_i1 = 0U;

        /* Entry 'ClosedLoop': '<S153>:4' */
      } else if (!dsPIC33CK256MP508_SMO_LVMC_DW.Enable) {
        /* Transition: '<S153>:20' */
        dsPIC33CK256MP508_SMO_LVMC_DW.is_c3_dsPIC33CK256MP508_SMO_LVMC =
          dsPIC33CK256MP508_SMO_LVMC_IN_Init;

        /* Entry 'Init': '<S153>:1' */
      } else {
        dsPIC33CK256MP508_SMO_LVMC_B.Mode = 1U;
      }
      break;
    }
  }

  /* End of Chart: '<S148>/Chart' */

  /* DataTypeConversion: '<S148>/Data Type Conversion' incorporates:
   *  DataStoreWrite: '<S148>/Data Store Write2'
   *  Switch: '<S148>/Switch2'
   */
  dsPIC33CK256MP508_SMO_LVMC_DW.EnableClosedLoop =
    (dsPIC33CK256MP508_SMO_LVMC_B.Mode > 1U);

  /* Outputs for Resettable SubSystem: '<S9>/Openloop Pos_PU' incorporates:
   *  ResetPort: '<S147>/Reset'
   */
  /* DataStoreRead: '<S9>/Data Store Read2' */
  if (dsPIC33CK256MP508_SMO_LVMC_DW.Enable &&
      (dsPIC33CK256MP508_SMO_LVMC_PrevZCX.OpenloopPos_PU_Reset_ZCE != POS_ZCSIG))
  {
    /* InitializeConditions for DiscreteIntegrator: '<S147>/Discrete-Time Integrator' */
    dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator_DSTATE = 0L;

    /* InitializeConditions for UnitDelay: '<S151>/Uni Delay' */
    dsPIC33CK256MP508_SMO_LVMC_DW.UniDelay_DSTATE = 0;

    /* InitializeConditions for UnitDelay: '<S151>/Uni Delay1' */
    dsPIC33CK256MP508_SMO_LVMC_DW.UniDelay1_DSTATE = true;

    /* InitializeConditions for DiscreteIntegrator: '<S150>/Discrete-Time Integrator' */
    dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator_IC_LOADING = 1U;
  }

  dsPIC33CK256MP508_SMO_LVMC_PrevZCX.OpenloopPos_PU_Reset_ZCE =
    dsPIC33CK256MP508_SMO_LVMC_DW.Enable;

  /* End of DataStoreRead: '<S9>/Data Store Read2' */

  /* Gain: '<S147>/Gain' incorporates:
   *  DiscreteIntegrator: '<S147>/Discrete-Time Integrator'
   *  Product: '<S106>/IProd Out'
   */
  rtb_IProdOut = (int16_T)mul_s32_loSR(12653L,
    dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator_DSTATE, 26UL);

  /* Gain: '<S152>/scale' incorporates:
   *  DeadZone: '<S102>/DeadZone'
   *  Product: '<S106>/IProd Out'
   */
  rtb_Integrator_i = rtb_IProdOut;

  /* Abs: '<S150>/Abs' incorporates:
   *  Gain: '<S152>/scale'
   *  Product: '<S106>/IProd Out'
   */
  if (rtb_IProdOut < 0) {
    rtb_Integrator_i = -rtb_IProdOut;
  }

  /* End of Abs: '<S150>/Abs' */

  /* DiscreteIntegrator: '<S150>/Discrete-Time Integrator' incorporates:
   *  Constant: '<S151>/PhaseOffset'
   *  Switch: '<S151>/Switch'
   */
  if (dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator_IC_LOADING != 0) {
    dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator_DSTATE_l = 0;
    if (dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator_DSTATE_l >= 16384)
    {
      dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator_DSTATE_l = 16384;
    } else if (dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator_DSTATE_l <=
               0) {
      dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator_DSTATE_l = 0;
    }
  }

  /* Abs: '<S151>/Abs' incorporates:
   *  UnitDelay: '<S151>/Uni Delay'
   */
  if (dsPIC33CK256MP508_SMO_LVMC_DW.UniDelay_DSTATE < 0) {
    rtb_Sum4_f = -dsPIC33CK256MP508_SMO_LVMC_DW.UniDelay_DSTATE;
  } else {
    rtb_Sum4_f = dsPIC33CK256MP508_SMO_LVMC_DW.UniDelay_DSTATE;
  }

  /* End of Abs: '<S151>/Abs' */

  /* DiscreteIntegrator: '<S150>/Discrete-Time Integrator' incorporates:
   *  Abs: '<S150>/Abs'
   *  Constant: '<S150>/Frequency1'
   *  Constant: '<S151>/PhaseOffset'
   *  Gain: '<S151>/gain'
   *  Logic: '<S151>/Logical Operator'
   *  RelationalOperator: '<S151>/Relatioal Operator'
   *  Sum: '<S151>/Add2'
   *  Switch: '<S151>/Switch'
   *  UnitDelay: '<S151>/Uni Delay1'
   */
  if ((rtb_Sum4_f > 16384 - (int16_T)((3L * rtb_Integrator_i) >> 1)) ||
      dsPIC33CK256MP508_SMO_LVMC_DW.UniDelay1_DSTATE) {
    dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator_DSTATE_l = 0;
    if (dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator_DSTATE_l >= 16384)
    {
      dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator_DSTATE_l = 16384;
    } else if (dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator_DSTATE_l <=
               0) {
      dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator_DSTATE_l = 0;
    }
  }

  if (dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator_DSTATE_l >= 16384) {
    dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator_DSTATE_l = 16384;
  } else if (dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator_DSTATE_l <= 0)
  {
    dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator_DSTATE_l = 0;
  }

  /* Switch: '<S150>/Direction' incorporates:
   *  Constant: '<S150>/ '
   *  DiscreteIntegrator: '<S150>/Discrete-Time Integrator'
   *  Product: '<S106>/IProd Out'
   *  Sum: '<S150>/Sum2'
   */
  if (rtb_IProdOut > 0) {
    rtb_IProdOut = dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator_DSTATE_l;
  } else {
    rtb_IProdOut = 16384 -
      dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator_DSTATE_l;
  }

  /* End of Switch: '<S150>/Direction' */

  /* Update for DiscreteIntegrator: '<S147>/Discrete-Time Integrator' incorporates:
   *  DataTypeConversion: '<S147>/Data Type Conversion'
   */
  dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator_DSTATE += 5L;
  if (dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator_DSTATE >= 181039L) {
    dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator_DSTATE = 181039L;
  } else if (dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator_DSTATE <= 0L)
  {
    dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator_DSTATE = 0L;
  }

