microchip-pic-avr-solutions/matlab-lvmc-dspic33ck256mp508-foc-smo/matlab-lvmc-dspic33ck256mp508-foc-smo/dsPIC33CK256MP508_SMO_LVMC.X/dsPIC33CK256MP508_SMO_LVMC.c
  /* End of Update for DiscreteIntegrator: '<S147>/Discrete-Time Integrator' */

  /* Update for UnitDelay: '<S151>/Uni Delay' incorporates:
   *  DiscreteIntegrator: '<S150>/Discrete-Time Integrator'
   */
  dsPIC33CK256MP508_SMO_LVMC_DW.UniDelay_DSTATE =
    dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator_DSTATE_l;

  /* Update for UnitDelay: '<S151>/Uni Delay1' */
  dsPIC33CK256MP508_SMO_LVMC_DW.UniDelay1_DSTATE = false;

  /* Update for DiscreteIntegrator: '<S150>/Discrete-Time Integrator' incorporates:
   *  Abs: '<S150>/Abs'
   */
  dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator_IC_LOADING = 0U;
  dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator_DSTATE_l +=
    rtb_Integrator_i;
  if (dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator_DSTATE_l >= 16384) {
    dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator_DSTATE_l = 16384;
  } else if (dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator_DSTATE_l <= 0)
  {
    dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator_DSTATE_l = 0;
  }

  /* End of Update for DiscreteIntegrator: '<S150>/Discrete-Time Integrator' */
  /* End of Outputs for SubSystem: '<S9>/Openloop Pos_PU' */

  /* Switch: '<S9>/Switch' incorporates:
   *  DataStoreWrite: '<S148>/Data Store Write2'
   *  Gain: '<S149>/Gain9'
   *  Gain: '<S150>/scale'
   *  Gain: '<S158>/Gain5'
   *  Product: '<S106>/IProd Out'
   *  Sum: '<S13>/sum_beta'
   */
  if (dsPIC33CK256MP508_SMO_LVMC_DW.EnableClosedLoop) {
    rtb_sum_beta = (int16_T)((20861L * rtb_Gain5) >> 15);
  } else {
    /* Outputs for Resettable SubSystem: '<S9>/Openloop Pos_PU' incorporates:
     *  ResetPort: '<S147>/Reset'
     */
    rtb_sum_beta = rtb_IProdOut;

    /* End of Outputs for SubSystem: '<S9>/Openloop Pos_PU' */
  }

  /* End of Switch: '<S9>/Switch' */

  /* Outputs for IfAction SubSystem: '<S129>/If Action Subsystem' incorporates:
   *  ActionPort: '<S131>/Action Port'
   */
  /* If: '<S129>/If' incorporates:
   *  DataTypeConversion: '<S131>/Convert_back'
   *  DataTypeConversion: '<S131>/Convert_uint16'
   *  DiscreteIntegrator: '<S58>/Integrator'
   *  Gain: '<S129>/convert_pu'
   *  Gain: '<S15>/indexing'
   *  Sum: '<S131>/Sum'
   *  Sum: '<S13>/sum_beta'
   */
  rtb_Integrator_i = (int16_T)(((rtb_sum_beta - ((rtb_sum_beta >> 14) << 14)) *
    25L) >> 4);

  /* End of Outputs for SubSystem: '<S129>/If Action Subsystem' */

  /* DataTypeConversion: '<S15>/Get_Integer' incorporates:
   *  DiscreteIntegrator: '<S58>/Integrator'
   */
  rtb_DataTypeConversion = (uint16_T)(rtb_Integrator_i >> 5);

  /* DataTypeConversion: '<S15>/Get_FractionVal' incorporates:
   *  DataTypeConversion: '<S15>/Data Type Conversion1'
   *  DiscreteIntegrator: '<S58>/Integrator'
   *  Sum: '<S15>/Sum2'
   */
  rtb_Integrator_i = (rtb_Integrator_i - ((int16_T)rtb_DataTypeConversion << 5))
    << 9;

  /* Selector: '<S15>/Lookup' incorporates:
   *  Constant: '<S15>/sine_table_values'
   *  Sum: '<S128>/Sum3'
   *  Sum: '<S15>/Sum'
   */
  rtb_IProdOut = dsPIC33CK256MP508_SMO_LVMC_ConstP.sine_table_values_Value
    [(int16_T)rtb_DataTypeConversion];

  /* Sum: '<S128>/Sum4' incorporates:
   *  Constant: '<S15>/offset'
   *  Constant: '<S15>/sine_table_values'
   *  DiscreteIntegrator: '<S58>/Integrator'
   *  Product: '<S128>/Product'
   *  Selector: '<S15>/Lookup'
   *  Sum: '<S128>/Sum3'
   *  Sum: '<S15>/Sum'
   */
  rtb_Sum4_f = (int16_T)(((int32_T)
    (dsPIC33CK256MP508_SMO_LVMC_ConstP.sine_table_values_Value[(int16_T)
     (rtb_DataTypeConversion + 1UL)] - rtb_IProdOut) * rtb_Integrator_i) >> 14)
    + rtb_IProdOut;

  /* Selector: '<S15>/Lookup' incorporates:
   *  Constant: '<S15>/offset'
   *  Constant: '<S15>/sine_table_values'
   *  Sum: '<S128>/Sum5'
   *  Sum: '<S15>/Sum'
   */
  rtb_IProdOut = dsPIC33CK256MP508_SMO_LVMC_ConstP.sine_table_values_Value
    [(int16_T)(rtb_DataTypeConversion + 200UL)];

  /* Sum: '<S128>/Sum6' incorporates:
   *  Constant: '<S15>/offset'
   *  Constant: '<S15>/sine_table_values'
   *  DiscreteIntegrator: '<S58>/Integrator'
   *  Product: '<S128>/Product1'
   *  Selector: '<S15>/Lookup'
   *  Sum: '<S128>/Sum5'
   *  Sum: '<S15>/Sum'
   */
  rtb_Gain7_e_idx_1 = (int16_T)(((int32_T)
    (dsPIC33CK256MP508_SMO_LVMC_ConstP.sine_table_values_Value[(int16_T)
     (rtb_DataTypeConversion + 201UL)] - rtb_IProdOut) * rtb_Integrator_i) >> 14)
    + rtb_IProdOut;

  /* Outputs for Atomic SubSystem: '<S5>/Park Transform' */
  /* Outputs for Atomic SubSystem: '<S5>/Clarke Transform' */
  /* Sum: '<S18>/Sum' incorporates:
   *  AlgorithmDescriptorDelegate generated from: '<S11>/a16'
   *  Product: '<S14>/acos'
   *  Product: '<S14>/bsin'
   *  Sum: '<S128>/Sum4'
   *  Sum: '<S128>/Sum6'
   *  Sum: '<S14>/sum_Ds'
   */
  rtb_Sum = (rtb_RateTransition5[0] - (int16_T)(((int32_T)rtb_ToPerUnit_idx_0 *
    rtb_Gain7_e_idx_1) >> 14)) - (int16_T)(((int32_T)rtb_ToPerUnit_idx_1 *
    rtb_Sum4_f) >> 14);

  /* End of Outputs for SubSystem: '<S5>/Clarke Transform' */
  /* End of Outputs for SubSystem: '<S5>/Park Transform' */

  /* Logic: '<S18>/Logical Operator' incorporates:
   *  DataStoreRead: '<S18>/Data Store Read'
   *  DataStoreRead: '<S18>/Data Store Read1'
   *  Logic: '<S18>/AND'
   *  Logic: '<S19>/AND'
   *  Logic: '<S19>/Logical Operator'
   */
  rtb_LogicalOperator_o_tmp = ((!dsPIC33CK256MP508_SMO_LVMC_DW.EnableFOC) ||
    (!dsPIC33CK256MP508_SMO_LVMC_DW.Enable));

  /* DiscreteIntegrator: '<S58>/Integrator' incorporates:
   *  Constant: '<S18>/Ki1'
   *  Logic: '<S18>/AND'
   *  Logic: '<S18>/Logical Operator'
   */
  if (rtb_LogicalOperator_o_tmp ||
      (dsPIC33CK256MP508_SMO_LVMC_DW.Integrator_PrevResetState != 0)) {
    dsPIC33CK256MP508_SMO_LVMC_DW.Integrator_DSTATE = 0;
  }

  /* Sum: '<S67>/Sum' incorporates:
   *  DeadZone: '<S51>/DeadZone'
   *  DiscreteIntegrator: '<S58>/Integrator'
   *  Product: '<S63>/PProd Out'
   *  Sum: '<S18>/Sum'
   */
  rtb_DeadZone = (int16_T)((rtb_Sum * 2317L) >> 10) +
    dsPIC33CK256MP508_SMO_LVMC_DW.Integrator_DSTATE;

  /* Saturate: '<S65>/Saturation' incorporates:
   *  DeadZone: '<S51>/DeadZone'
   */
  if (rtb_DeadZone > 16384) {
    rtb_Gain7_e_idx_0 = 16384;
  } else if (rtb_DeadZone < -16384) {
    rtb_Gain7_e_idx_0 = -16384;
  } else {
    rtb_Gain7_e_idx_0 = rtb_DeadZone;
  }

