microchip-pic-avr-solutions/matlab-lvmc-dspic33ck256mp508-foc-smo/matlab-lvmc-dspic33ck256mp508-foc-smo/dsPIC33CK256MP508_SMO_LVMC.X/dsPIC33CK256MP508_SMO_LVMC.c
  /* End of Saturate: '<S65>/Saturation' */

  /* Outputs for Atomic SubSystem: '<S5>/Park Transform' */
  /* Outputs for Atomic SubSystem: '<S5>/Clarke Transform' */
  /* Sum: '<S19>/Sum' incorporates:
   *  AlgorithmDescriptorDelegate generated from: '<S11>/a16'
   *  Product: '<S14>/asin'
   *  Product: '<S14>/bcos'
   *  Sum: '<S128>/Sum4'
   *  Sum: '<S128>/Sum6'
   *  Sum: '<S14>/sum_Qs'
   */
  rtb_sum_beta = (rtb_RateTransition5[1] - (int16_T)(((int32_T)
    rtb_ToPerUnit_idx_1 * rtb_Gain7_e_idx_1) >> 14)) + (int16_T)(((int32_T)
    rtb_ToPerUnit_idx_0 * rtb_Sum4_f) >> 14);

  /* End of Outputs for SubSystem: '<S5>/Clarke Transform' */
  /* End of Outputs for SubSystem: '<S5>/Park Transform' */

  /* DiscreteIntegrator: '<S109>/Integrator' incorporates:
   *  Constant: '<S19>/Kp1'
   */
  if (rtb_LogicalOperator_o_tmp ||
      (dsPIC33CK256MP508_SMO_LVMC_DW.Integrator_PrevResetState_a != 0)) {
    dsPIC33CK256MP508_SMO_LVMC_DW.Integrator_DSTATE_d = 0;
  }

  /* Sum: '<S118>/Sum' incorporates:
   *  DeadZone: '<S102>/DeadZone'
   *  DiscreteIntegrator: '<S109>/Integrator'
   *  Product: '<S114>/PProd Out'
   *  Sum: '<S19>/Sum'
   */
  rtb_Integrator_i = (int16_T)((rtb_sum_beta * 2317L) >> 10) +
    dsPIC33CK256MP508_SMO_LVMC_DW.Integrator_DSTATE_d;

  /* Saturate: '<S116>/Saturation' incorporates:
   *  DeadZone: '<S102>/DeadZone'
   */
  if (rtb_Integrator_i > 16384) {
    rtb_Saturation_g = 16384;
  } else if (rtb_Integrator_i < -16384) {
    rtb_Saturation_g = -16384;
  } else {
    rtb_Saturation_g = rtb_Integrator_i;
  }

  /* End of Saturate: '<S116>/Saturation' */

  /* Sum: '<S23>/Sum2' incorporates:
   *  Product: '<S106>/IProd Out'
   *  Product: '<S23>/Product'
   *  Product: '<S23>/Product1'
   *  Saturate: '<S116>/Saturation'
   *  Saturate: '<S65>/Saturation'
   */
  rtb_IProdOut = (int16_T)(((int32_T)rtb_Gain7_e_idx_0 * rtb_Gain7_e_idx_0) >>
    14) + (int16_T)(((int32_T)rtb_Saturation_g * rtb_Saturation_g) >> 14);

  /* Sqrt: '<S23>/Sqrt' incorporates:
   *  Product: '<S106>/IProd Out'
   */
  rtb_IProdOut = MCHP_MACRO_sqrt_Qxx(rtb_IProdOut, 1);

  /* If: '<S17>/If1' incorporates:
   *  RelationalOperator: '<S20>/Compare'
   *  Sqrt: '<S23>/Sqrt'
   */
  if (rtb_IProdOut >= 15565) {
    /* Outputs for IfAction SubSystem: '<S17>/Limiter' incorporates:
     *  ActionPort: '<S22>/Action Port'
     */
    /* Gain: '<S22>/Gain' incorporates:
     *  Math: '<S22>/Math Function2'
     *
     * About '<S22>/Math Function2':
     *  Operator: reciprocal
     */
    rtb_IProdOut = (int16_T)(((int16_T)(268435456L / rtb_IProdOut) * 15565L) >>
      14);

    /* Product: '<S22>/Product2' incorporates:
     *  Gain: '<S22>/Gain'
     *  Merge: '<S17>/Merge'
     */
    rtb_RateTransition5[0] = (int16_T)(((int32_T)rtb_IProdOut *
      rtb_Gain7_e_idx_0) >> 14);
    rtb_RateTransition5[1] = (int16_T)(((int32_T)rtb_IProdOut * rtb_Saturation_g)
      >> 14);

    /* End of Outputs for SubSystem: '<S17>/Limiter' */
  } else {
    /* Outputs for IfAction SubSystem: '<S17>/If Action Subsystem1' incorporates:
     *  ActionPort: '<S21>/Action Port'
     */
    /* SignalConversion generated from: '<S21>/In1' incorporates:
     *  Merge: '<S17>/Merge'
     */
    rtb_RateTransition5[0] = rtb_Gain7_e_idx_0;
    rtb_RateTransition5[1] = rtb_Saturation_g;

    /* End of Outputs for SubSystem: '<S17>/If Action Subsystem1' */
  }

  /* End of If: '<S17>/If1' */

  /* Outputs for Atomic SubSystem: '<S5>/Inverse Park Transform' */
  /* Switch: '<S126>/Switch' incorporates:
   *  Gain: '<S149>/Gain7'
   *  Product: '<S13>/dcos'
   *  Product: '<S13>/dsin'
   *  Product: '<S13>/qcos'
   *  Product: '<S13>/qsin'
   *  Sum: '<S128>/Sum4'
   *  Sum: '<S128>/Sum6'
   *  Sum: '<S13>/sum_alpha'
   *  Sum: '<S13>/sum_beta'
   */
  rtb_Gain7_e_idx_0 = (int16_T)(((int32_T)rtb_RateTransition5[0] *
    rtb_Gain7_e_idx_1) >> 14) - (int16_T)(((int32_T)rtb_RateTransition5[1] *
    rtb_Sum4_f) >> 14);
  rtb_Gain7_e_idx_1 = (int16_T)(((int32_T)rtb_RateTransition5[1] *
    rtb_Gain7_e_idx_1) >> 14) + (int16_T)(((int32_T)rtb_RateTransition5[0] *
    rtb_Sum4_f) >> 14);

  /* End of Outputs for SubSystem: '<S5>/Inverse Park Transform' */

  /* Switch: '<S8>/Enable motor control' incorporates:
   *  Constant: '<S8>/Constant2'
   *  DataStoreRead: '<S8>/Enable'
   */
  if (dsPIC33CK256MP508_SMO_LVMC_DW.Enable) {
    /* Switch: '<S8>/Switch for Current offset calibration' incorporates:
     *  Constant: '<S8>/Constant2'
     *  DataStoreWrite: '<S141>/Data Store Write'
     *  Gain: '<S141>/Gain'
     *  Logic: '<S141>/AND'
     *  RelationalOperator: '<S145>/Compare'
     *  RelationalOperator: '<S146>/Compare'
     *  Switch: '<S8>/Switch for rotor alignment'
     */
    if (EnCurOffset) {
      rtb_DataTypeConversion = 0U;
      rtb_DeadtimeCompensation_idx_1 = 0U;
      rtb_DeadtimeCompensation_idx_2 = 0U;
    } else if ((rtb_Gain_d > 4096) && (rtb_Gain_d < 8192)) {
      /* Switch: '<S8>/Switch for rotor alignment' incorporates:
       *  Constant: '<S8>/Constant3'
       *  Constant: '<S8>/Constant4'
       */
      rtb_DataTypeConversion = 2128U;
      rtb_DeadtimeCompensation_idx_1 = 1371U;
      rtb_DeadtimeCompensation_idx_2 = 1371U;
    } else {
      /* Outputs for Atomic SubSystem: '<S5>/Inverse Park Transform' */
      /* Gain: '<S138>/sqrt3_by_two' incorporates:
       *  AlgorithmDescriptorDelegate generated from: '<S13>/a16'
       *  MinMax: '<S136>/Max'
       *  Switch: '<S8>/Switch for rotor alignment'
       */
      rtb_IProdOut = (int16_T)((14189L * rtb_Gain7_e_idx_1) >> 14);

      /* Gain: '<S138>/one_by_two' incorporates:
       *  AlgorithmDescriptorDelegate generated from: '<S13>/a16'
       *  Gain: '<S136>/one_by_two'
       *  Switch: '<S8>/Switch for rotor alignment'
       */
      rtb_Gain_d = rtb_Gain7_e_idx_0 >> 1;

      /* End of Outputs for SubSystem: '<S5>/Inverse Park Transform' */

      /* Sum: '<S138>/add_c' incorporates:
       *  Gain: '<S136>/one_by_two'
       *  MinMax: '<S136>/Max'
       *  Switch: '<S8>/Switch for rotor alignment'
       */
      rtb_Sum4_f = -rtb_Gain_d - rtb_IProdOut;

      /* Sum: '<S138>/add_b' incorporates:
       *  Gain: '<S136>/one_by_two'
       *  MinMax: '<S136>/Max'
       *  Switch: '<S8>/Switch for rotor alignment'
       */
      rtb_IProdOut -= rtb_Gain_d;

