microchip-pic-avr-solutions/matlab-lvmc-dspic33ck256mp508-foc-smo/matlab-lvmc-dspic33ck256mp508-foc-smo/dsPIC33CK256MP508_SMO_LVMC.X/dsPIC33CK256MP508_SMO_LVMC.c
      /* Outputs for Atomic SubSystem: '<S5>/Inverse Park Transform' */
      /* MinMax: '<S136>/Min' incorporates:
       *  AlgorithmDescriptorDelegate generated from: '<S13>/a16'
       *  Sum: '<S138>/add_b'
       *  Switch: '<S8>/Switch for rotor alignment'
       */
      if (rtb_Gain7_e_idx_0 <= rtb_IProdOut) {
        rtb_Gain_d = rtb_Gain7_e_idx_0;
      } else {
        rtb_Gain_d = rtb_IProdOut;
      }

      /* MinMax: '<S136>/Max' incorporates:
       *  AlgorithmDescriptorDelegate generated from: '<S13>/a16'
       *  Sum: '<S138>/add_b'
       *  Sum: '<S138>/add_c'
       *  Switch: '<S8>/Switch for rotor alignment'
       */
      if (rtb_Gain7_e_idx_0 >= rtb_IProdOut) {
        rtb_Saturation_g = rtb_Gain7_e_idx_0;
      } else {
        rtb_Saturation_g = rtb_IProdOut;
      }

      /* End of Outputs for SubSystem: '<S5>/Inverse Park Transform' */
      if (rtb_Saturation_g < rtb_Sum4_f) {
        rtb_Saturation_g = rtb_Sum4_f;
      }

      /* End of MinMax: '<S136>/Max' */

      /* MinMax: '<S136>/Min' incorporates:
       *  Sum: '<S138>/add_c'
       *  Switch: '<S8>/Switch for rotor alignment'
       */
      if (rtb_Gain_d > rtb_Sum4_f) {
        rtb_Gain_d = rtb_Sum4_f;
      }

      /* Gain: '<S136>/one_by_two' incorporates:
       *  Sum: '<S136>/Add'
       *  Switch: '<S8>/Switch for rotor alignment'
       */
      rtb_Gain_d = (int16_T)(-(int32_T)(rtb_Saturation_g + rtb_Gain_d) >> 1);

      /* Outputs for Atomic SubSystem: '<S5>/Inverse Park Transform' */
      /* Switch: '<S8>/Switch for rotor alignment' incorporates:
       *  AlgorithmDescriptorDelegate generated from: '<S13>/a16'
       *  Constant: '<S8>/Constant'
       *  Gain: '<S135>/Gain'
       *  Gain: '<S136>/one_by_two'
       *  Gain: '<S8>/One_by_Two'
       *  Gain: '<S8>/Scale_to_PWM_Counter_PRD'
       *  Sum: '<S135>/Add1'
       *  Sum: '<S135>/Add2'
       *  Sum: '<S135>/Add3'
       *  Sum: '<S138>/add_b'
       *  Sum: '<S138>/add_c'
       *  Sum: '<S8>/Sum'
       */
      rtb_DataTypeConversion = (uint16_T)(((((int16_T)(((rtb_Gain7_e_idx_0 +
        rtb_Gain_d) * 18919L) >> 14) >> 1) + 8192) * 5001L) >> 14);

      /* End of Outputs for SubSystem: '<S5>/Inverse Park Transform' */
      rtb_DeadtimeCompensation_idx_1 = (uint16_T)(((((int16_T)(((rtb_IProdOut +
        rtb_Gain_d) * 18919L) >> 14) >> 1) + 8192) * 5001L) >> 14);
      rtb_DeadtimeCompensation_idx_2 = (uint16_T)(((((int16_T)(((rtb_Gain_d +
        rtb_Sum4_f) * 18919L) >> 14) >> 1) + 8192) * 5001L) >> 14);
    }

    /* End of Switch: '<S8>/Switch for Current offset calibration' */
  } else {
    rtb_DataTypeConversion = 0U;
    rtb_DeadtimeCompensation_idx_1 = 0U;
    rtb_DeadtimeCompensation_idx_2 = 0U;
  }

  /* End of Switch: '<S8>/Enable motor control' */

  /* DiscreteIntegrator: '<S149>/Discrete-Time Integrator3' incorporates:
   *  Delay: '<S1>/Delay'
   *  DiscreteIntegrator: '<S154>/Discrete-Time Integrator'
   *  Gain: '<S149>/Gain4'
   *  Gain: '<S149>/Gain7'
   *  Gain: '<S155>/Inverting OpAmp3'
   *  Gain: '<S155>/Inverting OpAmp4'
   *  Sum: '<S149>/Sum4'
   *  Switch: '<S156>/Switch1'
   */
  rtb_RateTransition5[0] = (int16_T)mul_s32_hiSR(439804651L, ((((((int16_T)
    ((14189L * dsPIC33CK256MP508_SMO_LVMC_DW.Delay_DSTATE_h[2]) >> 13) >> 1) -
    ((int16_T)((9339L * rtb_Sum4_j_idx_0) >> 15) >> 1)) - (rtb_Switch1_j_idx_0 <<
    2)) - (DiscreteTimeIntegrator_idx_0 << 2)) * 11111L) >> 1, 11UL) +
    dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator3_DSTATE[0];
  rtb_RateTransition5[1] = (int16_T)mul_s32_hiSR(439804651L, ((((((int16_T)
    ((14189L * dsPIC33CK256MP508_SMO_LVMC_DW.Delay_DSTATE_h[3]) >> 13) >> 1) -
    ((int16_T)((9339L * rtb_Sum4_j_idx_1) >> 15) >> 1)) - (rtb_Switch1 << 2)) -
    (DiscreteTimeIntegrator << 2)) * 11111L) >> 1, 11UL) +
    dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator3_DSTATE[1];

  /* Saturate: '<S6>/Saturation low side turn  on' incorporates:
   *  Bias: '<S6>/Dead time Compensation'
   */
  if (rtb_DataTypeConversion + 100U > 5000U) {
    /* Saturate: '<S6>/Saturation low side turn  on' */
    dsPIC33CK256MP508_SMO_LVMC_B.Saturationlowsideturnon[0] = 5000U;
  } else if (rtb_DataTypeConversion + 100U < 200U) {
    /* Saturate: '<S6>/Saturation low side turn  on' */
    dsPIC33CK256MP508_SMO_LVMC_B.Saturationlowsideturnon[0] = 200U;
  } else {
    /* Saturate: '<S6>/Saturation low side turn  on' */
    dsPIC33CK256MP508_SMO_LVMC_B.Saturationlowsideturnon[0] =
      rtb_DataTypeConversion + 100U;
  }

  if (rtb_DeadtimeCompensation_idx_1 + 100U > 5000U) {
    /* Saturate: '<S6>/Saturation low side turn  on' */
    dsPIC33CK256MP508_SMO_LVMC_B.Saturationlowsideturnon[1] = 5000U;
  } else if (rtb_DeadtimeCompensation_idx_1 + 100U < 200U) {
    /* Saturate: '<S6>/Saturation low side turn  on' */
    dsPIC33CK256MP508_SMO_LVMC_B.Saturationlowsideturnon[1] = 200U;
  } else {
    /* Saturate: '<S6>/Saturation low side turn  on' */
    dsPIC33CK256MP508_SMO_LVMC_B.Saturationlowsideturnon[1] =
      rtb_DeadtimeCompensation_idx_1 + 100U;
  }

  if (rtb_DeadtimeCompensation_idx_2 + 100U > 5000U) {
    /* Saturate: '<S6>/Saturation low side turn  on' */
    dsPIC33CK256MP508_SMO_LVMC_B.Saturationlowsideturnon[2] = 5000U;
  } else if (rtb_DeadtimeCompensation_idx_2 + 100U < 200U) {
    /* Saturate: '<S6>/Saturation low side turn  on' */
    dsPIC33CK256MP508_SMO_LVMC_B.Saturationlowsideturnon[2] = 200U;
  } else {
    /* Saturate: '<S6>/Saturation low side turn  on' */
    dsPIC33CK256MP508_SMO_LVMC_B.Saturationlowsideturnon[2] =
      rtb_DeadtimeCompensation_idx_2 + 100U;
  }

  /* End of Saturate: '<S6>/Saturation low side turn  on' */

  /* S-Function (MCHP_PWM_HS_FEP): '<S6>/PWM_HS_FEP' */
  /* Update PWM Duty Cycle */
  PG4DC = dsPIC33CK256MP508_SMO_LVMC_B.Saturationlowsideturnon[2];/* Update PWM4 Duty Cycle */
  PG2DC = dsPIC33CK256MP508_SMO_LVMC_B.Saturationlowsideturnon[1];/* Update PWM2 Duty Cycle */
  PG1DC = dsPIC33CK256MP508_SMO_LVMC_B.Saturationlowsideturnon[0];/* Update PWM1 Duty Cycle */
  PG1STATbits.UPDREQ = 1;              /* synchronized UPDATE */

  /* DeadZone: '<S51>/DeadZone' */
  if (rtb_DeadZone > 16384) {
    rtb_DeadZone -= 16384;
  } else if (rtb_DeadZone >= -16384) {
    rtb_DeadZone = 0;
  } else {
    rtb_DeadZone -= -16384;
  }

  /* End of DeadZone: '<S51>/DeadZone' */

  /* Product: '<S55>/IProd Out' incorporates:
   *  Constant: '<S18>/Ki'
   *  Product: '<S106>/IProd Out'
   *  Sum: '<S18>/Sum'
   */
  rtb_IProdOut = (int16_T)((rtb_Sum * 1869L) >> 14);

  /* Switch: '<S49>/Switch1' incorporates:
   *  Constant: '<S49>/Constant'
   *  Constant: '<S49>/Constant2'
   *  DeadZone: '<S51>/DeadZone'
   *  RelationalOperator: '<S49>/fix for DT propagation issue'
   */
  if (rtb_DeadZone > 0) {
    rtb_DeadZone_0 = 1;
  } else {
    rtb_DeadZone_0 = -1;
  }

  /* End of Switch: '<S49>/Switch1' */

  /* Switch: '<S49>/Switch2' incorporates:
   *  Constant: '<S49>/Constant3'
   *  Constant: '<S49>/Constant4'
   *  Product: '<S106>/IProd Out'
   *  RelationalOperator: '<S49>/fix for DT propagation issue1'
   */
  if (rtb_IProdOut > 0) {
    rtb_IProdOut_i = 1;
  } else {
    rtb_IProdOut_i = -1;
  }

  /* End of Switch: '<S49>/Switch2' */

  /* Switch: '<S49>/Switch' incorporates:
   *  Constant: '<S49>/Constant1'
   *  DeadZone: '<S51>/DeadZone'
   *  Logic: '<S49>/AND3'
   *  Product: '<S106>/IProd Out'
   *  RelationalOperator: '<S49>/Equal1'
   *  RelationalOperator: '<S49>/Relational Operator'
   */
  if ((rtb_DeadZone != 0) && (rtb_DeadZone_0 == rtb_IProdOut_i)) {
    rtb_Gain_d = 0;
  } else {
    rtb_Gain_d = rtb_IProdOut;
  }

  /* End of Switch: '<S49>/Switch' */

  /* DeadZone: '<S102>/DeadZone' */
  if (rtb_Integrator_i > 16384) {
    rtb_Integrator_i -= 16384;
  } else if (rtb_Integrator_i >= -16384) {
    rtb_Integrator_i = 0;
  } else {
    rtb_Integrator_i -= -16384;
  }

  /* End of DeadZone: '<S102>/DeadZone' */

  /* Product: '<S106>/IProd Out' incorporates:
   *  Constant: '<S19>/Ki'
   *  Sum: '<S19>/Sum'
   */
  rtb_IProdOut = (int16_T)((rtb_sum_beta * 1869L) >> 14);

  /* DataStoreRead: '<S1>/Data Store Read' */
  dsPIC33CK256MP508_SMO_LVMC_B.Speed_Ref =
    dsPIC33CK256MP508_SMO_LVMC_DW.SpeedRef;

