microchip-pic-avr-solutions/matlab-lvmc-dspic33ck256mp508-foc-smo/matlab-lvmc-dspic33ck256mp508-foc-smo/dsPIC33CK256MP508_SMO_LVMC.X/dsPIC33CK256MP508_SMO_LVMC.c
  /* DataTypeConversion: '<S7>/Data Type Conversion' incorporates:
   *  S-Function (MCHP_ADC_HighSpeed_SAR_dsPIC): '<S7>/ADC dsPIC High Speed SAR'
   */
  dsPIC33CK256MP508_SMO_LVMC_B.DataTypeConversion = (int16_T)
    (dsPIC33CK256MP508_SMO_LVMC_B.U2CH2 >> 2);

  /* Update for Delay: '<S140>/Delay' incorporates:
   *  DataStoreWrite: '<S141>/Data Store Write1'
   */
  dsPIC33CK256MP508_SMO_LVMC_DW.Delay_DSTATE_n =
    dsPIC33CK256MP508_SMO_LVMC_DW.EnableFOC;

  /* Outputs for Atomic SubSystem: '<S5>/Clarke Transform' */
  /* Update for Delay: '<S1>/Delay' incorporates:
   *  AlgorithmDescriptorDelegate generated from: '<S11>/a16'
   *  AlgorithmDescriptorDelegate generated from: '<S13>/a16'
   *  SignalConversion generated from: '<S1>/Delay'
   */
  dsPIC33CK256MP508_SMO_LVMC_DW.Delay_DSTATE_h[0] = rtb_ToPerUnit_idx_0;

  /* End of Outputs for SubSystem: '<S5>/Clarke Transform' */
  dsPIC33CK256MP508_SMO_LVMC_DW.Delay_DSTATE_h[1] = rtb_ToPerUnit_idx_1;

  /* Outputs for Atomic SubSystem: '<S5>/Inverse Park Transform' */
  dsPIC33CK256MP508_SMO_LVMC_DW.Delay_DSTATE_h[2] = rtb_Gain7_e_idx_0;
  dsPIC33CK256MP508_SMO_LVMC_DW.Delay_DSTATE_h[3] = rtb_Gain7_e_idx_1;

  /* End of Outputs for SubSystem: '<S5>/Inverse Park Transform' */

  /* Update for UnitDelay: '<S157>/Unit Delay3' incorporates:
   *  Gain: '<S158>/Gain5'
   */
  dsPIC33CK256MP508_SMO_LVMC_DW.UnitDelay3_DSTATE = rtb_Gain5;

  /* Update for Delay: '<S157>/Delay1' incorporates:
   *  DiscreteIntegrator: '<S157>/Discrete-Time Integrator4'
   */
  dsPIC33CK256MP508_SMO_LVMC_DW.Delay1_DSTATE = DiscreteTimeIntegrator4;

  /* Update for DiscreteIntegrator: '<S157>/Discrete-Time Integrator4' */
  dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator4_DSTATE =
    DiscreteTimeIntegrator4;

  /* Update for DiscreteIntegrator: '<S58>/Integrator' incorporates:
   *  Logic: '<S18>/AND'
   *  Logic: '<S18>/Logical Operator'
   *  Switch: '<S49>/Switch'
   */
  dsPIC33CK256MP508_SMO_LVMC_DW.Integrator_DSTATE += rtb_Gain_d;
  dsPIC33CK256MP508_SMO_LVMC_DW.Integrator_PrevResetState = (int8_T)
    rtb_LogicalOperator_o_tmp;

  /* Switch: '<S100>/Switch1' incorporates:
   *  Constant: '<S100>/Constant'
   *  Constant: '<S100>/Constant2'
   *  DeadZone: '<S102>/DeadZone'
   *  RelationalOperator: '<S100>/fix for DT propagation issue'
   */
  if (rtb_Integrator_i > 0) {
    rtb_DeadZone_0 = 1;
  } else {
    rtb_DeadZone_0 = -1;
  }

  /* End of Switch: '<S100>/Switch1' */

  /* Switch: '<S100>/Switch2' incorporates:
   *  Constant: '<S100>/Constant3'
   *  Constant: '<S100>/Constant4'
   *  Product: '<S106>/IProd Out'
   *  RelationalOperator: '<S100>/fix for DT propagation issue1'
   */
  if (rtb_IProdOut > 0) {
    rtb_IProdOut_i = 1;
  } else {
    rtb_IProdOut_i = -1;
  }

  /* End of Switch: '<S100>/Switch2' */

  /* Switch: '<S100>/Switch' incorporates:
   *  Constant: '<S100>/Constant1'
   *  DeadZone: '<S102>/DeadZone'
   *  Logic: '<S100>/AND3'
   *  RelationalOperator: '<S100>/Equal1'
   *  RelationalOperator: '<S100>/Relational Operator'
   */
  if ((rtb_Integrator_i != 0) && (rtb_DeadZone_0 == rtb_IProdOut_i)) {
    rtb_IProdOut = 0;
  }

  /* End of Switch: '<S100>/Switch' */

  /* Update for DiscreteIntegrator: '<S109>/Integrator' incorporates:
   *  Logic: '<S18>/AND'
   *  Logic: '<S18>/Logical Operator'
   */
  dsPIC33CK256MP508_SMO_LVMC_DW.Integrator_DSTATE_d += rtb_IProdOut;
  dsPIC33CK256MP508_SMO_LVMC_DW.Integrator_PrevResetState_a = (int8_T)
    rtb_LogicalOperator_o_tmp;

  /* Update for Delay: '<S149>/Delay2' incorporates:
   *  DiscreteIntegrator: '<S149>/Discrete-Time Integrator3'
   */
  dsPIC33CK256MP508_SMO_LVMC_DW.Delay2_DSTATE[0] = rtb_RateTransition5[0];

  /* Update for Delay: '<S154>/Delay' incorporates:
   *  DiscreteIntegrator: '<S154>/Discrete-Time Integrator'
   */
  dsPIC33CK256MP508_SMO_LVMC_DW.Delay_DSTATE_i[0] = DiscreteTimeIntegrator_idx_0;

  /* Update for DiscreteIntegrator: '<S154>/Discrete-Time Integrator' incorporates:
   *  Delay: '<S154>/Delay'
   */
  dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator_DSTATE_e[0] =
    DiscreteTimeIntegrator_idx_0;

  /* Update for Delay: '<S154>/Delay3' incorporates:
   *  DiscreteIntegrator: '<S154>/Discrete-Time Integrator2'
   */
  dsPIC33CK256MP508_SMO_LVMC_DW.Delay3_DSTATE[0] = DiscreteTimeIntegrator2_idx_0;

  /* Update for DiscreteIntegrator: '<S154>/Discrete-Time Integrator2' incorporates:
   *  Delay: '<S154>/Delay3'
   */
  dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator2_DSTATE[0] =
    DiscreteTimeIntegrator2_idx_0;

  /* Update for DiscreteIntegrator: '<S149>/Discrete-Time Integrator3' incorporates:
   *  Delay: '<S149>/Delay2'
   */
  dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator3_DSTATE[0] =
    rtb_RateTransition5[0];

  /* Update for Delay: '<S149>/Delay2' incorporates:
   *  DiscreteIntegrator: '<S149>/Discrete-Time Integrator3'
   */
  dsPIC33CK256MP508_SMO_LVMC_DW.Delay2_DSTATE[1] = rtb_RateTransition5[1];

  /* Update for Delay: '<S154>/Delay' */
  dsPIC33CK256MP508_SMO_LVMC_DW.Delay_DSTATE_i[1] = DiscreteTimeIntegrator;

  /* Update for DiscreteIntegrator: '<S154>/Discrete-Time Integrator' */
  dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator_DSTATE_e[1] =
    DiscreteTimeIntegrator;

  /* Update for Delay: '<S154>/Delay3' incorporates:
   *  DiscreteIntegrator: '<S154>/Discrete-Time Integrator2'
   */
  dsPIC33CK256MP508_SMO_LVMC_DW.Delay3_DSTATE[1] = DiscreteTimeIntegrator2_idx_1;

  /* Update for DiscreteIntegrator: '<S154>/Discrete-Time Integrator2' incorporates:
   *  Delay: '<S154>/Delay3'
   */
  dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator2_DSTATE[1] =
    DiscreteTimeIntegrator2_idx_1;

  /* Update for DiscreteIntegrator: '<S149>/Discrete-Time Integrator3' incorporates:
   *  Delay: '<S149>/Delay2'
   */
  dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator3_DSTATE[1] =
    rtb_RateTransition5[1];
}

/* Model step function for TID1 */
void dsPIC33CK256MP508_SMO_LVMC_step1(void) /* Sample time: [0.0015s, 0.0s] */
{
  /* RateTransition: '<Root>/Rate Transition6' incorporates:
   *  DataTypeConversion: '<S7>/Data Type Conversion'
   */
  dsPIC33CK256MP508_SMO_LVMC_B.RateTransition6 =
    dsPIC33CK256MP508_SMO_LVMC_B.DataTypeConversion;

  /* RateTransition: '<Root>/Rate Transition7' incorporates:
   *  Gain: '<S149>/Gain8'
   */
  dsPIC33CK256MP508_SMO_LVMC_B.RateTransition7 =
    dsPIC33CK256MP508_SMO_LVMC_B.Gain8;

  /* Outputs for Atomic SubSystem: '<Root>/Speed Control' */
  dsPIC33CK256MP508_SMO_LVMC_SpeedControl();

  /* End of Outputs for SubSystem: '<Root>/Speed Control' */

  /* RateTransition: '<Root>/Rate Transition5' */
  dsPIC33CK256MP508_SMO_LVMC_DW.RateTransition5_Buffer
    [(dsPIC33CK256MP508_SMO_LVMC_DW.RateTransition5_ActiveBufIdx == 0) << 1] =
    dsPIC33CK256MP508_SMO_LVMC_B.Id_ref;
  dsPIC33CK256MP508_SMO_LVMC_DW.RateTransition5_Buffer[1 +
    ((dsPIC33CK256MP508_SMO_LVMC_DW.RateTransition5_ActiveBufIdx == 0) << 1)] =
    dsPIC33CK256MP508_SMO_LVMC_B.Switch;
  dsPIC33CK256MP508_SMO_LVMC_DW.RateTransition5_ActiveBufIdx = (int8_T)
    (dsPIC33CK256MP508_SMO_LVMC_DW.RateTransition5_ActiveBufIdx == 0);
}

/* Model step function for TID2 */
void dsPIC33CK256MP508_SMO_LVMC_step2(void) /* Sample time: [0.005s, 0.0s] */
{
  int16_T rtb_IndexVector;

  /* MultiPortSwitch: '<S10>/Index Vector' incorporates:
   *  DataStoreRead: '<S1>/Data Store Read'
   *  Gain: '<S149>/Gain8'
   *  UnitDelay: '<S161>/Output'
   */
  if (dsPIC33CK256MP508_SMO_LVMC_DW.Output_DSTATE == 0) {
    rtb_IndexVector = dsPIC33CK256MP508_SMO_LVMC_B.Gain8;
  } else {
    rtb_IndexVector = dsPIC33CK256MP508_SMO_LVMC_B.Speed_Ref;
  }

  /* End of MultiPortSwitch: '<S10>/Index Vector' */

