microchip-pic-avr-solutions/matlab-lvmc-dspic33ck256mp508-foc-smo/matlab-lvmc-dspic33ck256mp508-foc-smo/dsPIC33CK256MP508_SMO_LVMC.X/dsPIC33CK256MP508_SMO_LVMC.c
  /* SignalConversion generated from: '<S166>/UART Tx' incorporates:
   *  ArithShift: '<S165>/Shift Arithmetic2'
   *  Constant: '<S166>/End'
   *  Constant: '<S166>/Start'
   *  DataTypeConversion: '<S165>/Data Type Conversion1'
   *  DataTypeConversion: '<S165>/Data Type Conversion2'
   *  DataTypeConversion: '<S165>/Data Type Conversion3'
   *  MultiPortSwitch: '<S10>/Index Vector'
   *  S-Function (sfix_bitop): '<S165>/Bitwise Operator2'
   *  UnitDelay: '<S161>/Output'
   */
  dsPIC33CK256MP508_SMO_LVMC_B.TmpSignalConversionAtUARTTxInport1[0] = 83U;
  dsPIC33CK256MP508_SMO_LVMC_B.TmpSignalConversionAtUARTTxInport1[1] =
    dsPIC33CK256MP508_SMO_LVMC_DW.Output_DSTATE;
  dsPIC33CK256MP508_SMO_LVMC_B.TmpSignalConversionAtUARTTxInport1[2] = (uint8_T)
    (rtb_IndexVector & 255U);
  dsPIC33CK256MP508_SMO_LVMC_B.TmpSignalConversionAtUARTTxInport1[3] = (uint8_T)
    ((uint16_T)rtb_IndexVector >> 8);
  dsPIC33CK256MP508_SMO_LVMC_B.TmpSignalConversionAtUARTTxInport1[4] = 69U;

  /* S-Function (MCHP_UART_Tx): '<S166>/UART Tx' */
  /* MCHP_UART_Tx Block: <S166>/UART Tx/Outputs */
  {
    uint_T Tmp;
    Tmp = ~(MCHP_UART1_Tx.tail - MCHP_UART1_Tx.head);/* head - tail - 1 */
    Tmp = Tmp & (Tx_BUFF_SIZE_UART1 - 1);
    /* Modulo Buffer Size (Buffer Size is 2^n). Tmp is the buffer free space */

    {
      uint_T i1 = 0;
      uint_T LocalTail = MCHP_UART1_Tx.tail;
      /* Tail is a volatile variable. Use local variable to speed-up execution */
      const uint8_T *u0 =
        &dsPIC33CK256MP508_SMO_LVMC_B.TmpSignalConversionAtUARTTxInport1[0] ;
      if (Tmp >= 5)         /* Does buffer can contains all char to be sent ? */
      {
        Tmp = 5 ;          /* If so, set tmp to the number of char to be sent */
      }
          /* Otherwise, send only the number of char which can be contained within the buffer (Tmp) */

      while (i1 < Tmp) {
        MCHP_UART1_Tx.buffer[LocalTail] = u0[i1];
        LocalTail = (LocalTail + 1) & (Tx_BUFF_SIZE_UART1 - 1);
        i1= i1 + 1;
      }

      MCHP_UART1_Tx.tail = LocalTail;  /* Push back volatile variable */
    }

    {
      uint_T LocalHead;
      int cpu_ipl_switchVar;
      cpu_ipl_switchVar = 5 << 5;      /* new IPL (SR bits 5,6,7) */
      cpu_ipl_switchVar ^= SR;         /* bit to reverse */
      cpu_ipl_switchVar &= 0xE0;       /* mask to not change other SR bits */
      SR ^= cpu_ipl_switchVar;
              /* mimic Tx interrupt, disable Tx & thread switching interrupts */
      LocalHead = MCHP_UART1_Tx.head;
      /* Head is a volatile variable. Use local variable to speed-up execution */
      _U1TXIF = 0;                     /* Clear Interrupt Flag */
      while ((0U == U1STAHbits.UTXBF) && (MCHP_UART1_Tx.tail != LocalHead) )/* while UxTXREG buffer is not full */
      {
        U1TXREG = MCHP_UART1_Tx.buffer[LocalHead++];
        LocalHead &= (Tx_BUFF_SIZE_UART1-1);
      }

      MCHP_UART1_Tx.head = LocalHead;  /* Push back volatile variable */
      SR ^= cpu_ipl_switchVar;      /* stop mimic UART TX interrupt IPL level */
    }
  }

  /* Switch: '<S164>/FixPt Switch' incorporates:
   *  Constant: '<S163>/FixPt Constant'
   *  Sum: '<S163>/FixPt Sum1'
   *  UnitDelay: '<S161>/Output'
   */
  if ((uint8_T)(dsPIC33CK256MP508_SMO_LVMC_DW.Output_DSTATE + 1U) > 3) {
    /* Update for UnitDelay: '<S161>/Output' incorporates:
     *  Constant: '<S164>/Constant'
     */
    dsPIC33CK256MP508_SMO_LVMC_DW.Output_DSTATE = 0U;
  } else {
    /* Update for UnitDelay: '<S161>/Output' */
    dsPIC33CK256MP508_SMO_LVMC_DW.Output_DSTATE++;
  }

  /* End of Switch: '<S164>/FixPt Switch' */
}

/* Model step function for TID3 */
void dsPIC33CK256MP508_SMO_LVMC_step3(void) /* Sample time: [0.1s, 0.0s] */
{
  boolean_T rtb_DataTypeConversion1_a;

  /* DataTypeConversion: '<S3>/Data Type Conversion1' incorporates:
   *  UnitDelay: '<S169>/Output'
   */
  rtb_DataTypeConversion1_a = (dsPIC33CK256MP508_SMO_LVMC_DW.Output_DSTATE_p !=
    0);

  /* S-Function (MCHP_Digital_Output_Write): '<S171>/Digital Output Write' */
  LATEbits.LATE7 = rtb_DataTypeConversion1_a;

  /* Update for UnitDelay: '<S169>/Output' incorporates:
   *  Constant: '<S174>/FixPt Constant'
   *  Sum: '<S174>/FixPt Sum1'
   */
  dsPIC33CK256MP508_SMO_LVMC_DW.Output_DSTATE_p = (uint8_T)((uint8_T)
    (dsPIC33CK256MP508_SMO_LVMC_DW.Output_DSTATE_p + 1U) & 1);
}

/* Model step function for TID4 */
void dsPIC33CK256MP508_SMO_LVMC_step4(void) /* Sample time: [0.5s, 0.0s] */
{
  boolean_T rtb_DataTypeConversion;

  /* DataTypeConversion: '<S3>/Data Type Conversion' incorporates:
   *  UnitDelay: '<S168>/Output'
   */
  rtb_DataTypeConversion = (dsPIC33CK256MP508_SMO_LVMC_DW.Output_DSTATE_l != 0);

  /* S-Function (MCHP_Digital_Output_Write): '<S170>/Digital Output Write' */
  LATEbits.LATE6 = rtb_DataTypeConversion;

  /* Update for UnitDelay: '<S168>/Output' incorporates:
   *  Constant: '<S172>/FixPt Constant'
   *  Sum: '<S172>/FixPt Sum1'
   */
  dsPIC33CK256MP508_SMO_LVMC_DW.Output_DSTATE_l = (uint8_T)((uint8_T)
    (dsPIC33CK256MP508_SMO_LVMC_DW.Output_DSTATE_l + 1U) & 1);
}

/* Model initialize function */
void dsPIC33CK256MP508_SMO_LVMC_initialize(void)
{
  /* Registration code */

  /* Set task counter limit used by the static main program */
  (dsPIC33CK256MP508_SMO_LVMC_M)->Timing.TaskCounters.cLimit[0] = 1;
  (dsPIC33CK256MP508_SMO_LVMC_M)->Timing.TaskCounters.cLimit[1] = 30;
  (dsPIC33CK256MP508_SMO_LVMC_M)->Timing.TaskCounters.cLimit[2] = 100;
  (dsPIC33CK256MP508_SMO_LVMC_M)->Timing.TaskCounters.cLimit[3] = 2000;
  (dsPIC33CK256MP508_SMO_LVMC_M)->Timing.TaskCounters.cLimit[4] = 10000;

  /* initialize error status */
  rtmSetErrorStatus(dsPIC33CK256MP508_SMO_LVMC_M, (NULL));

  /* block I/O */
  (void) memset(((void *) &dsPIC33CK256MP508_SMO_LVMC_B), 0,
                sizeof(B_dsPIC33CK256MP508_SMO_LVMC_T));

  /* states (dwork) */
  (void) memset((void *)&dsPIC33CK256MP508_SMO_LVMC_DW, 0,
                sizeof(DW_dsPIC33CK256MP508_SMO_LVMC_T));

  /* Start for S-Function (MCHP_ADC_HighSpeed_SAR_dsPIC): '<S7>/ADC dsPIC High Speed SAR' */

