microchip-pic-avr-solutions/matlab-lvmc-dspic33ck256mp508-foc-smo/matlab-lvmc-dspic33ck256mp508-foc-smo/dsPIC33CK256MP508_SMO_LVMC.X/dsPIC33CK256MP508_SMO_LVMC.c
  /* ADC common settings */
  ADCON1Hbits.FORM = 1;                /* Fractional format */
  ADCON5Hbits.WARMTIME = 10;  /* Warm-up time, minimum is 10us (DS700005213F) */
  ADCON3Hbits.CLKSEL = 1;              /* Select input clock source */
  ADCON3Hbits.CLKDIV = 1;              /* clock pre scaler */
  ADCON3Lbits.REFSEL = 0;         /* Select AVdd and AVss as reference source */

  /* Configuration for ADC Core */
  ADCON4Hbits.C0CHS = 0;               /* Dedicated core - Input pins */
  ADCON4Hbits.C1CHS = 0;               /* Dedicated core - Input pins */
  ADCORE0L = 101;
  /* ADC Sample Time for dedicated ADC (SAMC field) (if SAMCEN not set-default => trig end sampling ) */
  ADCORE1L = 101;
  /* ADC Sample Time for dedicated ADC (SAMC field) (if SAMCEN not set-default => trig end sampling ) */
  ADCON2Hbits.SHRSAMC = 102;           /* ADC Sample Time for shared ADC7 */
  ADCON4Lbits.SAMC0EN = 1;
                  /* Trig start (or continue) sampling for a time set in SAMC */
  ADCON4Lbits.SAMC1EN = 1;
                  /* Trig start (or continue) sampling for a time set in SAMC */
  ADMOD0Lbits.SIGN0 = 1;             /* Signed (1) / Unsigned (0) data format */
  ADMOD0Lbits.SIGN1 = 1;             /* Signed (1) / Unsigned (0) data format */
  ADTRIG0Lbits.TRGSRC0 = 4;            /* CH0 Trigger source */
  ADTRIG0Lbits.TRGSRC1 = 4;            /* CH1 Trigger source */
  ADTRIG2Hbits.TRGSRC11 = 4;           /* CH11 Trigger source */
  ADLVLTRGLbits.LVLEN0 = 0;            /* Input trig is edge sensitive */
  ADLVLTRGLbits.LVLEN1 = 0;            /* Input trig is edge sensitive */
  ADLVLTRGLbits.LVLEN11 = 0;           /* Input trig is edge sensitive */
  ADCORE0Hbits.ADCS = 1;               /* ADC Clock Frequency for core 0 */
  ADCORE1Hbits.ADCS = 1;               /* ADC Clock Frequency for core 1 */
  ADCON2Lbits.SHRADCS = 1;             /* ADC Clock Frequency for shared ADC7 */
  ADCORE0Hbits.RES = 3;                /* ADC Resolution for core 0 */
  ADCORE1Hbits.RES = 3;                /* ADC Resolution for core 1 */
  ADCON1Hbits.SHRRES = 3;              /* ADC Resolution for shared ADC7 */
  ADIELbits.IE11 = 1;                  /* enable interrupt for ADC channel 11 */
  _ADCAN11IP = 2;                      /* Set Interrupt priority for tasking */
  _ADCAN11IF = 0;                      /* Reset pending interrupt */
  _ADCAN11IE = 1;      /* Enable Interrupt which trig the base rate time step */

  /* Turn on ADC module common to all ADC core */
  ADCON1Lbits.ADON = 1;

  /* Switch on dedicated ADC core 0 */
  ADCON5Lbits.C0PWR = 1;         /* Turn on Analog power for dedicated core 0 */
  while (ADCON5Lbits.C0RDY == 0) ;     /* Wait for core 0 ready */
  ADCON3Hbits.C0EN = 1;  /* Turn on Digital power enabling triggers to core 0 */

  /* Switch on dedicated ADC core 1 */
  ADCON5Lbits.C1PWR = 1;         /* Turn on Analog power for dedicated core 1 */
  while (ADCON5Lbits.C1RDY == 0) ;     /* Wait for core 1 ready */
  ADCON3Hbits.C1EN = 1;  /* Turn on Digital power enabling triggers to core 1 */

  /* Switch on shared ADC core */
  ADCON5Lbits.SHRPWR = 1;             /* Turn on Analog power for shared core */
  while (ADCON5Lbits.SHRRDY == 0) ;    /* Wait for shared core ready */
  ADCON3Hbits.SHREN = 1; /* Turn on Digital power enabling triggers to shared */

  /* Start for S-Function (MCHP_PWM_HS_FEP): '<S6>/PWM_HS_FEP' */

  /* Set initial Dead Time */
  PG1DTH = 200U;                       /* 1.0E-6s */
  PG2DTH = 200U;                       /* 1.0E-6s */
  PG4DTH = 200U;                       /* 1.0E-6s */
  PG1DTL = 200U;                       /* 1.0E-6s */
  PG2DTL = 200U;                       /* 1.0E-6s */
  PG4DTL = 200U;                       /* 1.0E-6s */

  /* Set initial PWM Period */
  PG4PER = 4999U;                      /* 5.0E-5s */
  PG2PER = 4999U;                      /* 5.0E-5s */
  PG1PER = 4999U;                      /* 5.0E-5s */

  /* Set initial PWM Duty Cycles */
  PG4DC = 200U;                        /* 2.0E-6s */
  PG2DC = 200U;                        /* 2.0E-6s */
  PG1DC = 200U;                        /* 2.0E-6s */

  /* Set Trigger (for ADC) initial values */
  PG1TRIGA = 0U;                       /* Trigger A (0.0s) for PWM 1 */

  /* Set PWM settings for each channels */
  {
    /* non volatile temp variable to precompute settings */
    PG1CONHBITS R_PG1CONH = { 0 };

    PG2CONHBITS R_PG2CONH = { 0 };

    PG4CONHBITS R_PG4CONH = { 0 };

    PG1CONLBITS R_PG1CONL = { 0 };

    PG2CONLBITS R_PG2CONL = { 0 };

    PG4CONLBITS R_PG4CONL = { 0 };

    PG1IOCONHBITS R_PG1IOCONH = { 0 };

    PG2IOCONHBITS R_PG2IOCONH = { 0 };

    PG4IOCONHBITS R_PG4IOCONH = { 0 };

    PG1EVTLBITS R_PG1EVTL = { 0 };

    /* PGxCONH */
    R_PG1CONH.SOCS = 0;                /* Start of Cycle is Local EOC */
    R_PG1CONH.MSTEN = 1;       /* Broadcast set of UPDREQ & EOC to other PWMs */
    R_PG1CONH.UPDMOD = 0;          /* PWM Update (00 next cycle, 01 Immedite) */
    PG1CONHbits = R_PG1CONH;           /* -- WRITE CONFIG -- */
    R_PG2CONH.SOCS = 1;  /* Start of Cycle sync with 1-4 => PG1 PG4 - PG5 PG8 */
    R_PG2CONH.UPDMOD = 2;     /* PWM Slave Update (2 next cycle, 3 immediate) */
    PG2CONHbits = R_PG2CONH;           /* -- WRITE CONFIG -- */
    R_PG4CONH.SOCS = 1;  /* Start of Cycle sync with 1-4 => PG1 PG4 - PG5 PG8 */
    R_PG4CONH.UPDMOD = 2;     /* PWM Slave Update (2 next cycle, 3 immediate) */
    PG4CONHbits = R_PG4CONH;           /* -- WRITE CONFIG -- */

    /* PGxCONL */
    R_PG1CONL.MODSEL = 4 ;             /* PWM mode */
    R_PG1CONL.CLKSEL = 1;              /* Clock Selection */
    R_PG1CONL.ON = 0;                  /* PWM Generator is disabled */
    PG1CONLbits = R_PG1CONL;           /* -- WRITE CONFIG -- */
    R_PG2CONL.MODSEL = 4 ;             /* PWM mode */
    R_PG2CONL.CLKSEL = 1;              /* Clock Selection */
    R_PG2CONL.ON = 1;                  /* PWM Generator is enabled */
    PG2CONLbits = R_PG2CONL;           /* -- WRITE CONFIG -- */
    R_PG4CONL.MODSEL = 4 ;             /* PWM mode */
    R_PG4CONL.CLKSEL = 1;              /* Clock Selection */
    R_PG4CONL.ON = 1;                  /* PWM Generator is enabled */
    PG4CONLbits = R_PG4CONL;           /* -- WRITE CONFIG -- */

    /* PGxIOCONH */
    R_PG1IOCONH.PENL = 1;              /* Enable PWMxL */
    R_PG1IOCONH.PENH = 1;              /* Enable PWMxH */
    PG1IOCONHbits = R_PG1IOCONH;       /* -- WRITE CONFIG -- */
    R_PG2IOCONH.PENL = 1;              /* Enable PWMxL */
    R_PG2IOCONH.PENH = 1;              /* Enable PWMxH */
    PG2IOCONHbits = R_PG2IOCONH;       /* -- WRITE CONFIG -- */
    R_PG4IOCONH.PENL = 1;              /* Enable PWMxL */
    R_PG4IOCONH.PENH = 1;              /* Enable PWMxH */
    PG4IOCONHbits = R_PG4IOCONH;       /* -- WRITE CONFIG -- */

