microchip-pic-avr-solutions/matlab-lvmc-dspic33ck256mp508-foc-smo/matlab-lvmc-dspic33ck256mp508-foc-smo/dsPIC33CK256MP508_SMO_LVMC.X/dsPIC33CK256MP508_SMO_LVMC.c
    /* PGxEVTL */
    R_PG1EVTL.ADTR1EN1 = 1;         /* PWM1 TRIG A is trig src for ADC Trig 1 */
    PG1EVTLbits = R_PG1EVTL;           /* -- WRITE CONFIG -- */
  }

  {                                   /* Shared Settings for all PWM channels */
  }

  /* Start for S-Function (MCHP_OP_AMP): '<S2>/Op-Amp' */
  {                                    /* Configure Op-Amp */
    AMPCON1HBITS R_AMPCON1H = { 0 };

    AMPCON1LBITS R_AMPCON1L = { 0 };

    R_AMPCON1H.NCHDIS1 = 1;            /* Reduce Op-Amp 1 non linearity */
    R_AMPCON1H.NCHDIS2 = 1;            /* Reduce Op-Amp 2 non linearity */
    AMPCON1Hbits = R_AMPCON1H;
    R_AMPCON1L.AMPEN1 = 1;             /* Enable Op-Amp 1 */
    R_AMPCON1L.AMPEN2 = 1;             /* Enable Op-Amp 2 */
    R_AMPCON1L.AMPON = 1;              /* Enable Op-Amp Module */
    AMPCON1Lbits = R_AMPCON1L;
  }

  /* Start for S-Function (MCHP_Master): '<S2>/Microchip Master' */

  /* S-Function "Microchip MASTER" initialization Block: <S2>/Microchip Master */

  /* Start for S-Function (MCHP_UART_Config): '<S2>/UART Configuration' */

  /* MCHP_UART_Config Block for UART 1: <S2>/UART Configuration/Initialize */
  U1BRG = 0xD9;                        /* Baud rate: 921600 (+0.01%) */
  U1BRGH = 0x00;                       /* Baud rate MSB */
  U1MODE = 0x8020;
  U1MODEH = 0x8C00;
  U1STA = 0x00;
  U1STAH = 0x0700;

  /* Configure UART1 using Tx Interruption */
  _U1TXIP = 5;                         /*  Tx Interrupt priority set to 5 */
  _U1TXIF = 0;                         /*  */
  _U1TXIE = 1;                         /* Enable Interrupt */
  dsPIC33CK256MP508_SMO_LVMC_PrevZCX.OpenloopPos_PU_Reset_ZCE = POS_ZCSIG;
  dsPIC33CK256MP508_SMO_LVMC_PrevZCX.TriggeredSubsystem_Trig_ZCE = ZERO_ZCSIG;

  /* InitializeConditions for DiscreteIntegrator: '<S58>/Integrator' incorporates:
   *  Constant: '<S18>/Ki1'
   */
  dsPIC33CK256MP508_SMO_LVMC_DW.Integrator_DSTATE = 0;
  dsPIC33CK256MP508_SMO_LVMC_DW.Integrator_PrevResetState = 0;

  /* InitializeConditions for DiscreteIntegrator: '<S109>/Integrator' incorporates:
   *  Constant: '<S19>/Kp1'
   */
  dsPIC33CK256MP508_SMO_LVMC_DW.Integrator_DSTATE_d = 0;
  dsPIC33CK256MP508_SMO_LVMC_DW.Integrator_PrevResetState_a = 0;

  /* SystemInitialize for Enabled SubSystem: '<S140>/Up Counter' */
  /* InitializeConditions for Delay: '<S142>/Delay' */
  dsPIC33CK256MP508_SMO_LVMC_DW.Delay_DSTATE = 0UL;

  /* End of SystemInitialize for SubSystem: '<S140>/Up Counter' */

  /* SystemInitialize for Chart: '<S148>/Chart' */
  dsPIC33CK256MP508_SMO_LVMC_DW.temporalCounter_i1 = 0U;
  dsPIC33CK256MP508_SMO_LVMC_DW.is_active_c3_dsPIC33CK256MP508_SMO_LVMC = 0U;
  dsPIC33CK256MP508_SMO_LVMC_DW.is_c3_dsPIC33CK256MP508_SMO_LVMC =
    dsPIC33CK256MP508_SMO_LVMC_IN_NO_ACTIVE_CHILD;
  dsPIC33CK256MP508_SMO_LVMC_B.Mode = 0U;

  /* SystemInitialize for Resettable SubSystem: '<S9>/Openloop Pos_PU' */
  /* InitializeConditions for DiscreteIntegrator: '<S147>/Discrete-Time Integrator' */
  dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator_DSTATE = 0L;

  /* InitializeConditions for UnitDelay: '<S151>/Uni Delay' */
  dsPIC33CK256MP508_SMO_LVMC_DW.UniDelay_DSTATE = 0;

  /* InitializeConditions for UnitDelay: '<S151>/Uni Delay1' */
  dsPIC33CK256MP508_SMO_LVMC_DW.UniDelay1_DSTATE = true;

  /* InitializeConditions for DiscreteIntegrator: '<S150>/Discrete-Time Integrator' */
  dsPIC33CK256MP508_SMO_LVMC_DW.DiscreteTimeIntegrator_IC_LOADING = 1U;

  /* End of SystemInitialize for SubSystem: '<S9>/Openloop Pos_PU' */

  /* SystemInitialize for Atomic SubSystem: '<Root>/Speed Control' */
  dsPIC33CK256MP508_SMO_LVMC_SpeedControl_Init();

  /* End of SystemInitialize for SubSystem: '<Root>/Speed Control' */
}

/* Model terminate function */
void dsPIC33CK256MP508_SMO_LVMC_terminate(void)
{
  /* Terminate for S-Function (MCHP_PWM_HS_FEP): '<S6>/PWM_HS_FEP' */

  /* Set initial Dead Time */
  PG1DTH = 200U;                       /* 1.0E-6s */
  PG2DTH = 200U;                       /* 1.0E-6s */
  PG4DTH = 200U;                       /* 1.0E-6s */
  PG1DTL = 200U;                       /* 1.0E-6s */
  PG2DTL = 200U;                       /* 1.0E-6s */
  PG4DTL = 200U;                       /* 1.0E-6s */

  /* Set initial PWM Period */
  PG4PER = 4999U;                      /* 5.0E-5s */
  PG2PER = 4999U;                      /* 5.0E-5s */
  PG1PER = 4999U;                      /* 5.0E-5s */

  /* Set initial PWM Duty Cycles */
  PG4DC = 200U;                        /* 2.0E-6s */
  PG2DC = 200U;                        /* 2.0E-6s */
  PG1DC = 200U;                        /* 2.0E-6s */

  /* Terminate for S-Function (MCHP_UART_Config): '<S2>/UART Configuration' */
  while (0U == U1STAbits.TRMT) ;       /* Wait until all byte are sent */
}

/*
 * File trailer for generated code.
 *
 * [EOF]
 */
